{
  "head": {
    "title": "แก้ไขข้อมูลเมตาเป็นไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{EnvName}}",
    "description": "API การประมวลผลข้อมูลเมตา {{EnvName}} เพื่อแก้ไขข้อมูลเมตาดาต้าเป็นไฟล์ {{FileFormatUp}} ทำงานร่วมกับมาตรฐานข้อมูลเมตา XMP, EXIF, IPTC, ID3 ฯลฯ"
  },
  "header": {
    "title": "อัปเดตข้อมูลเมตาจากไฟล์ {{FileformatCap}} ใน {{ProgLang}}",
    "description": "ตัวแก้ไขข้อมูลเมตาสำหรับแอปพลิเคชัน {{ProgLang}} – เปลี่ยนฟิลด์ข้อมูลเมตาจากเอกสาร รูปภาพ และรูปแบบไฟล์มัลติมีเดียยอดนิยมทั้งหมดโดยใช้ API ตัวแก้ไขข้อมูลเมตาสำหรับ {{ProgLang}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API ของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันการจัดการฟิลด์ข้อมูลเมตาขั้นสูงเพื่อให้อ่าน เพิ่ม แก้ไข ลบ ค้นหา เปรียบเทียบ แทนที่ และส่งออกข้อมูลเมตาดาต้าจากรูปภาพและรูปแบบเอกสารได้อย่างง่ายดายโดยไม่ต้องใช้ซอฟต์แวร์ภายนอกใดๆ . แก้ไขรายละเอียดข้อมูลเมตาจากเอกสาร Word, สเปรดชีต Excel, งานนำเสนอ PowerPoint, อีเมล Outlook, OneNote, Visio, โครงการ, PDF, AutoCAD, ZIp, รูปแบบไฟล์เสียงและวิดีโอ พร้อมทั้งรองรับการทำงานกับคุณสมบัติการประมวลผลข้อมูลเมตาอื่น ๆ อีกมากมาย"
  },
  "formats": {
    "title": "การเปลี่ยนข้อมูลเมตาของรูปแบบไฟล์อื่น",
    "description": "API การแก้ไขข้อมูลเมตาของเอกสารและรูปภาพหลายรูปแบบสำหรับ {{EnvName}} ดึงข้อมูลเมตาของรูปแบบไฟล์ยอดนิยมบางรูปแบบตามที่ระบุไว้ด้านล่าง"
  },
  "examples": {
    "comment_1": "แก้ไขข้อมูลเมตาวันที่สร้าง {{FileFormatUp}}",
    "comment_2": "อัปเดตวันที่/เวลาที่สร้างไฟล์หากค่าที่มีอยู่เก่ากว่า 3 วัน",
    "comment_3": "กำหนดข้อกำหนดของคุณเองเพื่อกรองคุณสมบัติข้อมูลเมตา",
    "comment_4": "ผลการอัพเดตกระบวนการ",
    "comment_5": "บันทึกไฟล์ที่แก้ไข"
  },
  "steps": {
    "title": "ขั้นตอนในการอัปเดตข้อมูลเมตาเป็น {{FileformatCap}} ใน {{EnvName}}",
    "content": {
      "title": "[{{ProdFullName}}]({{ProductUrl}}) ทำให้นักพัฒนา {{EnvName}} แก้ไขรายละเอียดข้อมูลเมตาเป็นไฟล์ {{FileformatCap}} จากภายในแอปพลิเคชันได้อย่างง่ายดายโดยทำตามขั้นตอนง่ายๆ เพียงไม่กี่ขั้นตอน",
      "step_1": "โหลดไฟล์ {{FileformatCap}} ที่จะอัปเดต",
      "step_2": "ระบุเพรดิเคตที่จะใช้เพื่อกรองคุณสมบัติเมทาดาทาที่ต้องการ",
      "step_3": "ส่งผ่านเพรดิเคตและค่าใหม่ไปยังเมธอด {{TextUpdateProperties}}",
      "step_4": "บันทึกการเปลี่ยนแปลง"
    }
  },
  "more_features": {
    "title": "จัดการข้อมูลเมตา {{FileFormatUp}} สำหรับแอป {{EnvName}}",
    "description": "API {{ProdShortName}} ช่วยให้นักพัฒนาอัปเดตข้อมูลเมตาที่ซ่อนอยู่ในรูปแบบเอกสารต่างๆ ในแอปพลิเคชัน {{EnvName}} ได้อย่างง่ายดาย นำไปใช้ แก้ไข ค้นหา และลบข้อมูลเมตาโดยทางโปรแกรม",
    "image_description": "การกำหนดค่าข้อมูลเมตา",
    "feature_1": {
      "title": "บูรณาการข้อมูลเมตาอย่างง่าย",
      "content": "{{ProdShortName}} ช่วยลดความยุ่งยากในการเพิ่มข้อมูลเมตาที่แตกต่างกันลงในเอกสารและไฟล์ภายในแอป {{EnvName}} ของคุณ นักพัฒนาสามารถใช้ อัปเดต หรือลบข้อมูลเมตาได้อย่างง่ายดาย"
    },
    "feature_2": {
      "title": "การควบคุมข้อมูลเมตาโดยละเอียด",
      "content": "API มีตัวเลือกมากมายสำหรับการปรับแต่งข้อมูลเมตา ง่ายต่อการค้นหาข้อมูลเมตาในไฟล์โดยใช้คำขอพิเศษและลบหรืออัปเดตไฟล์เหล่านั้น"
    },
    "feature_3": {
      "title": "การใช้คุณลักษณะดั้งเดิมของ {{FileFormatUp}}",
      "content": "นักพัฒนาสามารถใช้ประโยชน์จากเมตาดาต้าในตัว เช่น EXIF ​​สำหรับรูปภาพ ทั้งนี้ขึ้นอยู่กับรูปแบบเอกสาร ซึ่งอาจรวมถึงข้อมูลเกี่ยวกับภาพถ่าย เช่น รุ่นและหมายเลขกล้อง ความละเอียด วันที่สร้าง และอื่นๆ"
    },
    "code_1": {
      "title": "อัปเดตแท็กเนื้อเพลงในไฟล์ MP3 (ตัวอย่าง)",
      "content": "ตัวอย่างนี้สาธิตการอัปเดตข้อมูลเมตาที่ซ่อนอยู่ในไฟล์สื่อ MP#",
      "comment_1": "โหลดไฟล์ไปยังตัวสร้างคลาส {{TextMetadata}}",
      "comment_2": "อัปเดตข้อมูลเนื้อเพลง",
      "comment_3": "คุณสามารถเพิ่มฟิลด์ที่กำหนดเองทั้งหมดให้กับแท็กได้",
      "comment_4": "บันทึกผลลัพธ์"
    }
  }
}