{
  "head": {
    "title": "Edit Metadata to {{FileFormatUp}} Files in {{EnvName}} Applications",
    "description": "{{EnvName}} metadata processing API to edit metadata information to {{FileFormatUp}} files. Work with metadata standards XMP, EXIF, IPTC, ID3 etc."
  },
  "header": {
    "title": "Update Metadata From {{FileformatCap}} File In {{ProgLang}}",
    "description": "Metadata Editor for {{ProgLang}} applications – Change metadata fields from all popular documents, images and multimedia file formats using metadata editor API for {{ProgLang}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download Free Trial"
  },
  "about": {
    "title": "About {{ProdFullName}} API",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is an advanced metadata fields manipulation solution to easily read, add, modify, delete, search, compare, replace and export metadata information from images and document formats without using any external software. Edit metadata details from Word documents, Excel spreadsheets, PowerPoint presentations, Outlook emails, OneNote, Visio, Project, PDF, AutoCAD, ZIp, Audio and Video file formats along with the support for working with many other metadata processing features."
  },
  "formats": {
    "title": "Changing Metadata Of Other File Formats",
    "description": "Multi format documents and images metadata editing API for {{EnvName}}. Retrieve metadata of some of the popular file formats as stated below"
  },
  "examples": {
    "comment_1": "Edit {{FileFormatUp}} creation date metadata",
    "comment_2": "Update the file creation date/time if the existing value is older than 3 days",
    "comment_3": "Define your own specifications to filter metadata properties",
    "comment_4": "Process updation result",
    "comment_5": "Save edited file"
  },
  "steps": {
    "title": "Steps for Updating Metadata to {{FileformatCap}} in {{EnvName}}",
    "content": {
      "title": "[{{ProdFullName}}]({{ProductUrl}}) makes it easy for {{EnvName}} developers to edit metadata details to {{FileformatCap}} files from within their applications by implementing a few easy steps.",
      "step_1": "Load the {{FileformatCap}} file to be updated",
      "step_2": "Specify a predicate that will be used to filter desired metadata properties.",
      "step_3": "Pass the predicate and the new value to the {{TextUpdateProperties}} method.",
      "step_4": "Save the changes."
    }
  },
  "more_features": {
    "title": "Manipulate {{FileFormatUp}} Metadata for {{EnvName}} Apps",
    "description": "The {{ProdShortName}} API lets developers easily update hidden metadata in various document formats in their {{EnvName}} applications. Apply, edit, search for, and remove metadata programmatically.",
    "image_description": "Metadata Configuration",
    "feature_1": {
      "title": "Simple Metadata Integration",
      "content": "{{ProdShortName}} simplifies adding different metadata to documents and files within your {{EnvName}} apps. Developers can effortlessly apply, update, or remove metadata."
    },
    "feature_2": {
      "title": "Detailed Metadata Control",
      "content": "The API offers extensive options for customizing metadata. It is easy to find metadata in files using special requests and remove or update them."
    },
    "feature_3": {
      "title": "Utilizing Native {{FileFormatUp}} Features",
      "content": "Depending on the document format, developers can leverage built-in metadata like EXIF for images. This might include information about photo like camera model and number, resolution, creation date and other."
    },
    "code_1": {
      "title": "Update the Lyrics tag in an MP3 file (Example)",
      "content": "This example demonstrates updating hidden metadata in MP# media-file.",
      "comment_1": "Load file to {{TextMetadata}} class constructor",
      "comment_2": "Update lyrics data",
      "comment_3": "You can add a fully custom field to the tag",
      "comment_4": "Save result"
    }
  }
}