{
  "head": {
    "title": "Редагувати метадані файлів {{FileFormatUp}} у програмах {{EnvName}}",
    "description": "API обробки метаданих {{EnvName}} для редагування інформації метаданих у файлах {{FileFormatUp}}. Робота зі стандартами метаданих XMP, EXIF, IPTC, ID3 тощо."
  },
  "header": {
    "title": "Оновити метадані з файлу {{FileformatCap}} у {{ProgLang}}",
    "description": "Редактор метаданих для програм {{ProgLang}} – змінюйте поля метаданих у всіх популярних форматах документів, зображень і мультимедійних файлів за допомогою API редактора метаданих для {{ProgLang}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажте безкоштовну пробну версію"
  },
  "about": {
    "title": "Про API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — це розширене рішення для роботи з полями метаданих, яке дозволяє легко читати, додавати, змінювати, видаляти, шукати, порівнювати, замінювати та експортувати метадані із зображень і форматів документів без використання зовнішнього програмного забезпечення. . Редагуйте деталі метаданих із документів Word, електронних таблиць Excel, презентацій PowerPoint, електронних листів Outlook, OneNote, Visio, Project, PDF, AutoCAD, ZIP, форматів аудіо- та відеофайлів разом із підтримкою роботи з багатьма іншими функціями обробки метаданих."
  },
  "formats": {
    "title": "Зміна метаданих інших форматів файлів",
    "description": "API редагування метаданих багатоформатних документів і зображень для {{EnvName}}. Отримайте метадані деяких популярних форматів файлів, як зазначено нижче"
  },
  "examples": {
    "comment_1": "Відредагуйте метадані дати створення {{FileFormatUp}}",
    "comment_2": "Оновіть дату/час створення файлу, якщо наявне значення старше 3 днів",
    "comment_3": "Визначте власні специфікації для фільтрації властивостей метаданих",
    "comment_4": "Результат оновлення процесу",
    "comment_5": "Зберегти відредагований файл"
  },
  "steps": {
    "title": "Кроки для оновлення метаданих до {{FileformatCap}} у {{EnvName}}",
    "content": {
      "title": "[{{ProdFullName}}]({{ProductUrl}}) полегшує розробникам {{EnvName}} редагування деталей метаданих файлів {{FileformatCap}} у своїх програмах, реалізувавши кілька простих кроків.",
      "step_1": "Завантажте файл {{FileformatCap}} для оновлення",
      "step_2": "Укажіть предикат, який використовуватиметься для фільтрації бажаних властивостей метаданих.",
      "step_3": "Передайте предикат і нове значення в метод {{TextUpdateProperties}}.",
      "step_4": "Збережіть зміни."
    }
  },
  "more_features": {
    "title": "Маніпулювати метаданими {{FileFormatUp}} для програм {{EnvName}}",
    "description": "API {{ProdShortName}} дозволяє розробникам легко оновлювати приховані метадані в різних форматах документів у своїх програмах {{EnvName}}. Застосовуйте, редагуйте, шукайте та видаляйте метадані програмним шляхом.",
    "image_description": "Конфігурація метаданих",
    "feature_1": {
      "title": "Проста інтеграція метаданих",
      "content": "{{ProdShortName}} спрощує додавання різних метаданих до документів і файлів у ваших програмах {{EnvName}}. Розробники можуть легко застосувати, оновити або видалити метадані."
    },
    "feature_2": {
      "title": "Детальний контроль метаданих",
      "content": "API пропонує широкі можливості для налаштування метаданих. За допомогою спеціальних запитів легко знайти метадані у файлах і видалити або оновити їх."
    },
    "feature_3": {
      "title": "Використання власних функцій {{FileFormatUp}}",
      "content": "Залежно від формату документа розробники можуть використовувати для зображень вбудовані метадані, такі як EXIF. Це може містити інформацію про фотографію, як-от модель і номер камери, роздільна здатність, дата створення тощо."
    },
    "code_1": {
      "title": "Оновити тег Lyrics у файлі MP3 (приклад)",
      "content": "Цей приклад демонструє оновлення прихованих метаданих у мультимедійному файлі MP#.",
      "comment_1": "Завантажте файл у конструктор класу {{TextMetadata}}",
      "comment_2": "Оновити дані текстів пісень",
      "comment_3": "До тегу можна додати повністю спеціальне поле",
      "comment_4": "Зберегти результат"
    }
  }
}