{
  "head": {
    "title": "แก้ไขข้อมูลเมตาเป็นไฟล์ {{FileformatCap}} ในแอปพลิเคชัน {{ProgLang}}",
    "description": "API การประมวลผลข้อมูลเมตา {{ProgLang}} เพื่อแก้ไขข้อมูลเมตาดาต้าเป็นไฟล์ {{FileformatCap}} ทำงานร่วมกับมาตรฐานข้อมูลเมตา XMP, EXIF, IPTC, ID3 ฯลฯ"
  },
  "header": {
    "title": "อัปเดตข้อมูลเมตาของไฟล์ {{FileformatCap}} ใน {{ProgLang}}",
    "description": "อัปเดตข้อมูลเมตาดาต้าจากเอกสาร รูปภาพ และรูปแบบไฟล์มัลติมีเดียยอดนิยมทั้งหมด พร้อมรองรับการดำเนินการประมวลผลเมทาดาทาที่จำเป็นที่สุดทั้งหมด",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API ของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) นำเสนอชุดคุณลักษณะการจัดการข้อมูลเมตาขั้นสูง ช่วยให้นักพัฒนาสามารถอ่าน เอกสาร ลบ ค้นหา เปรียบเทียบ แทนที่ และส่งออกข้อมูลเมตาดาต้าจากรูปภาพและรูปแบบเอกสารได้อย่างง่ายดายโดยไม่ต้องใช้ใดๆ ซอฟต์แวร์ภายนอก ใช้ API การจัดการข้อมูลเมตาเพื่อแก้ไขรายละเอียดข้อมูลเมตาจาก PDF, Microsoft Office Word, สเปรดชีต Excel, งานนำเสนอ PowerPoint, อีเมล Outlook, OneNote, Visio, โครงการ, AutoCAD, ไฟล์เก็บถาวร และไฟล์มัลติมีเดีย พร้อมการสนับสนุนสำหรับการทำงานกับคุณสมบัติการประมวลผลข้อมูลเมตาอื่น ๆ อีกมากมาย"
  },
  "formats": {
    "title": "การอัปเดตคุณสมบัติข้อมูลเมตาจากรูปแบบไฟล์อื่น",
    "description": "API การแก้ไขข้อมูลเมตาของเอกสารและรูปภาพหลายรูปแบบสำหรับ {{EnvName}} ดึงข้อมูลเมตาของรูปแบบไฟล์ยอดนิยมบางรูปแบบตามที่ระบุไว้ด้านล่าง"
  },
  "examples": {
    "comment_1": "แก้ไขวันที่สร้าง {{FileFormatUp}}",
    "comment_2": "ตั้งค่าของแต่ละคุณสมบัติที่ตรงกับภาคแสดง:",
    "comment_3": "คุณสมบัติประกอบด้วยวันที่/เวลาที่เอกสารถูกสร้างขึ้น",
    "comment_4": "อัปเดตวันที่/เวลาที่สร้างไฟล์หากค่าที่มีอยู่เก่ากว่า 3 วัน",
    "comment_5": "บันทึกผลลัพธ์ {{FileFormatUp}}"
  },
  "steps": {
    "title": "ขั้นตอนในการอัปเดตข้อมูลเมตาเป็น {{FileFormatUp}} ใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdFullName}}]({{ProductUrl}}) ทำให้นักพัฒนา {{EnvName}} แก้ไขข้อมูลเมตาดาต้าเป็นไฟล์ {{FileFormatUp}} จากภายในแอปพลิเคชันได้อย่างง่ายดายโดยทำตามขั้นตอนง่ายๆ เพียงไม่กี่ขั้นตอน",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} ผ่านอินสแตนซ์ของคลาส {{TextMetadata}}",
      "step_2": "ระบุเพรดิเคตที่จะใช้เพื่อกรองคุณสมบัติเมทาดาทาที่ต้องการ",
      "step_3": "ส่งผ่านเพรดิเคตและค่าใหม่ไปยังเมธอด {{TextUpdateProperties}}",
      "step_4": "บันทึกการเปลี่ยนแปลงลงแผ่นดิสก์ในรูปแบบ {{FileFormatUp}}"
    }
  },
  "more_features": {
    "title": "จัดการคุณสมบัติข้อมูลเมตาภายใน {{FileFormatUp}} สำหรับแอป {{EnvName}}",
    "description": "{{ProdShortName}} API ช่วยให้นักพัฒนาแก้ไขรายละเอียดเอกสาร (ข้อมูลเมตา) ในรูปแบบต่างๆ ได้อย่างง่ายดายโดยใช้แอปพลิเคชัน {{EnvName}} เพิ่ม อัปเดต ค้นหา และลบคุณสมบัติเอกสารโดยทางโปรแกรม",
    "image_description": "การจัดการทรัพย์สินเมตาดาต้าเอกสาร",
    "feature_1": {
      "title": "การบูรณาการข้อมูลเมตาที่มีประสิทธิภาพ",
      "content": "{{ProdShortName}} ช่วยลดความยุ่งยากในการเพิ่มคุณสมบัติต่างๆ ให้กับเอกสารและไฟล์ภายในแอป {{EnvName}} ของคุณ นักพัฒนาสามารถใช้ อัปเดต หรือลบคุณสมบัติของเอกสารได้อย่างง่ายดายโดยทางโปรแกรม"
    },
    "feature_2": {
      "title": "การควบคุมข้อมูลเมตาที่แม่นยำ",
      "content": "API มีตัวเลือกมากมายสำหรับการจัดการคุณสมบัติเอกสาร นักพัฒนาสามารถค้นหาและประมวลผลข้อมูลที่ซ่อนอยู่ในไฟล์ธุรกิจได้อย่างมีประสิทธิภาพ"
    },
    "feature_3": {
      "title": "การใช้ประโยชน์จากคุณสมบัติ {{FileFormatUp}} ในตัว",
      "content": "นักพัฒนาสามารถใช้คุณสมบัติที่มีอยู่ เช่น ข้อมูล EXIF ​​สำหรับรูปภาพ ทั้งนี้ขึ้นอยู่กับรูปแบบเอกสาร ซึ่งอาจรวมถึงข้อมูลต่างๆ เช่น รายละเอียดกล้อง ความละเอียด วันที่สร้าง และอื่นๆ"
    },
    "code_1": {
      "title": "อัปเดตข้อมูลเมตาของเนื้อเพลงในไฟล์ MP3 (ตัวอย่าง)",
      "content": "ตัวอย่างนี้สาธิตการอัปเดตข้อมูลที่ซ่อน (ข้อมูลเมตา) ในไฟล์เสียง MP3",
      "comment_1": "โหลดไฟล์โดยใช้คลาส {{TextMetadata}}",
      "comment_2": "อัปเดตข้อมูลเนื้อเพลง",
      "comment_3": "คุณสามารถเพิ่มฟิลด์ที่กำหนดเองลงในข้อมูลเมตาได้",
      "comment_4": "บันทึกไฟล์ที่อัพเดต"
    }
  }
}