{
  "head": {
    "title": "แก้ไขข้อมูลเมตะในไฟล์ {{FileformatCap}} โดยใช้ {{ProgLang}}",
    "description": "ใช้ API {{ProgLang}} ในการแก้ไขข้อมูลเมตะในไฟล์ {{FileformatCap}} รองรับ XMP, EXIF, IPTC, ID3 และรูปแบบข้อมูลเมตะอื่นๆ"
  },
  "header": {
    "title": "ปรับข้อมูลเมตะในไฟล์ {{FileformatCap}} ด้วย {{ProgLang}}",
    "description": "แก้ไขข้อมูลเมตะในเอกสาร รูปภาพ และรูปแบบสื่อที่พบบ่อย ทำการดำเนินการสำคัญเช่น อ่าน อัปเดต และลบข้อมูลเมตะ",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ให้เครื่องมือที่มีประสิทธิภาพสำหรับการจัดการข้อมูลเมตะใน {{ProgLang}} ซึ่งช่วยให้คุณอ่าน อัปเดต ลบ ค้นหา เปรียบเทียบ และส่งออกข้อมูลเมตะจากไฟล์โดยไม่ต้องใช้ซอฟต์แวร์เพิ่มเติม ใช้ API เพื่อทำงานกับข้อมูลเมตะในไฟล์ PDF เอกสาร Microsoft Office อีเมล Outlook แผนภาพ Visio แบบร่าง AutoCAD แฟ้มเก็บข้อมูล และไฟล์สื่อ ผสานรวมฟีเจอร์ข้อมูลเมตะที่ยืดหยุ่นเข้ากับแอปพลิเคชัน {{ProdShortName}} ได้ง่าย"
  },
  "formats": {
    "title": "แก้ไขข้อมูลเมตะในประเภทไฟล์อื่น",
    "description": "API แก้ไขข้อมูลเมตะข้ามรูปแบบสำหรับ {{ProgLang}} รองรับการจัดการข้อมูลเมตะสำหรับประเภทเอกสารและรูปภาพที่นิยมมากมายตามที่แสดงด้านล่าง"
  },
  "examples": {
    "comment_1": "เปลี่ยนวันที่สร้างของไฟล์ {{FileFormatUp}}",
    "comment_2": "กำหนดกฎเพื่อค้นหาว่าข้อมูลเมตะใดที่ต้องอัปเดต",
    "comment_3": "กำหนดค่าที่ใหม่ให้กับคุณสมบัติที่เลือก",
    "comment_4": "อัปเดตเวลาสร้างของไฟล์",
    "comment_5": "บันทึกไฟล์ {{FileFormatUp}} ที่อัปเดตแล้ว"
  },
  "steps": {
    "title": "วิธีแก้ไขข้อมูลเมตะในไฟล์ {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "ด้วย [{{ProdFullName}}]({{ProductUrl}}) นักพัฒนา {{ProgLang}} สามารถอัปเดตข้อมูลเมตะในไฟล์ {{FileFormatUp}} ได้ตามขั้นตอนง่ายๆ ต่อไปนี้:",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} โดยใช้คลาส {{TextMetadata}}",
      "step_2": "กำหนดเงื่อนไขเพื่อกรองข้อมูลเมตะที่คุณต้องการเปลี่ยน",
      "step_3": "ใช้ฟิลเตอร์และตั้งค่าค่าที่ใหม่",
      "step_4": "บันทึกไฟล์ {{FileFormatUp}} ที่อัปเดตแล้วลงในดิสก์"
    }
  },
  "more_features": {
    "title": "แก้ไขข้อมูลเมตะในไฟล์ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ด้วย {{ProdShortName}} คุณสามารถจัดการข้อมูลเมตะเอกสารในแอป {{ProgLang}} ของคุณได้ เพิ่ม เปลี่ยน ค้นหา หรือ ลบข้อมูลเมตะอย่างเป็นระบบ",
    "image_description": "เครื่องมือสำหรับการแก้ไขข้อมูลเมตะ",
    "feature_1": {
      "title": "การจัดการข้อมูลเมตะอย่างง่ายดาย",
      "content": "{{ProdShortName}} ช่วยให้คุณเพิ่ม แก้ไข หรือ ลบข้อมูลเมตะในแอป {{ProgLang}} ของคุณได้"
    },
    "feature_2": {
      "title": "ควบคุมข้อมูลเมตะอย่างเต็มที่",
      "content": "ใช้ API เพื่อค้นหา ดู และปรับเปลี่ยนข้อมูลที่ซ่อนอยู่ในรูปแบบไฟล์ธุรกิจต่าง ๆ"
    },
    "feature_3": {
      "title": "ใช้แท็ก {{FileFormatUp}} ที่มีอยู่",
      "content": "เข้าถึงและทำงานกับข้อมูลเมตะที่มีอยู่ เช่น แท็ก EXIF ในภาพ รวมถึงข้อมูลเช่นประเภทของกล้อง ขนาด หรือวันที่ถ่าย"
    },
    "code_1": {
      "title": "แก้ไขข้อมูลเมตะ MP3: อัปเดตเนื้อเพลง",
      "content": "ตัวอย่างนี้แสดงวิธีเปลี่ยนข้อมูลเมตะในไฟล์ MP3 รวมถึงเนื้อเพลงและฟิลด์กำหนดเอง",
      "comment_1": "เปิดไฟล์โดยใช้ {{TextMetadata}}",
      "comment_2": "แก้ไขแท็กเนื้อเพลง",
      "comment_3": "เพิ่มฟิลด์ข้อมูลเมตะกำหนดเองตามที่จำเป็น",
      "comment_4": "บันทึกการเปลี่ยนแปลงในไฟล์"
    }
  }
}