{
  "head": {
    "title": "แก้ไขข้อมูลเมตาในไฟล์ {{FileFormatUp}} ด้วยแอปพลิเคชัน {{EnvNameShort}}",
    "description": "ใช้ API ข้อมูลเมตา {{EnvNameShort}} เพื่อแก้ไขข้อมูลเมตาในไฟล์ {{FileFormatUp}} รองรับ XMP, EXIF, IPTC, ID3 และอื่นๆ"
  },
  "header": {
    "title": "อัปเดตข้อมูลเมตาในไฟล์ {{FileformatCap}} โดยใช้ {{ProgLang}}",
    "description": "โปรแกรมแก้ไขข้อมูลเมตาสำหรับ {{ProgLang}} – แก้ไขช่องข้อมูลเมตาในเอกสาร รูปภาพ และไฟล์มัลติมีเดียด้วย API ของเรา",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API ของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันขั้นสูงสำหรับการอ่าน เพิ่ม แก้ไข ลบ ค้นหา เปรียบเทียบ แทนที่ และส่งออกข้อมูลเมตาจากรูปภาพและเอกสาร แก้ไขข้อมูลเมตาในไฟล์ Word, Excel, PowerPoint, Outlook, OneNote, Visio, Project, PDF, AutoCAD, ZIP, เสียงและวิดีโอ พร้อมด้วยฟีเจอร์อื่น ๆ อีกมากมาย"
  },
  "formats": {
    "title": "แก้ไขข้อมูลเมตาในรูปแบบไฟล์ต่างๆ",
    "description": "API การแก้ไขข้อมูลเมตาของเอกสารและรูปภาพหลายรูปแบบสำหรับ {{EnvNameShort}} ดึงและแก้ไขข้อมูลเมตาสำหรับรูปแบบไฟล์ยอดนิยม"
  },
  "examples": {
    "comment_1": "อัปเดตข้อมูลเมตาวันที่/เวลาที่พิมพ์ล่าสุดของไฟล์หลังจากการพิมพ์",
    "comment_2": "โหลดไฟล์ลงในตัวสร้างคลาส {{TextMetadata}}",
    "comment_3": "เฉพาะแพ็คเกจข้อมูลเมตาที่มีอยู่เท่านั้นที่ได้รับผลกระทบ ไม่มีการเพิ่มแพ็คเกจใหม่",
    "comment_4": "ผลการประมวลผล",
    "comment_5": "บันทึกไฟล์ที่อัพเดต"
  },
  "steps": {
    "title": "ขั้นตอนในการอัปเดตข้อมูลเมตาใน {{FileformatCap}} โดยใช้ {{EnvNameShort}}",
    "content": {
      "title": "[{{ProdFullName}}]({{ProductUrl}}) อนุญาตให้แก้ไขข้อมูลเมตาในไฟล์ {{FileformatCap}} ด้วยขั้นตอนง่ายๆ เพียงไม่กี่ขั้นตอน",
      "step_1": "โหลดไฟล์ {{FileformatCap}} ที่จะอัปเดต",
      "step_2": "ระบุเพรดิเคตเพื่อกรองคุณสมบัติเมทาดาทาที่ต้องการ",
      "step_3": "ส่งผ่านเพรดิเคตและค่าใหม่ไปยังเมธอด {{TextUpdateProperties}}",
      "step_4": "บันทึกการเปลี่ยนแปลง"
    }
  },
  "more_features": {
    "title": "แก้ไขข้อมูลเมตา {{FileFormatUp}} สำหรับแอป {{EnvNameShort}}",
    "description": "API {{ProdShortName}} ช่วยให้นักพัฒนาสามารถอัปเดตข้อมูลเมตาที่ซ่อนอยู่ในรูปแบบเอกสารต่างๆ ภายในแอปพลิเคชัน {{EnvName}} นำไปใช้ แก้ไข ค้นหา และลบข้อมูลเมตาโดยทางโปรแกรม",
    "image_description": "การกำหนดค่าข้อมูลเมตา",
    "feature_1": {
      "title": "บูรณาการข้อมูลเมตาได้ง่าย",
      "content": "{{ProdShortName}} ทำให้การเพิ่มและแก้ไขข้อมูลเมตาในเอกสารและไฟล์ภายในแอป {{EnvName}} ของคุณเป็นเรื่องง่าย นักพัฒนาสามารถใช้ อัปเดต หรือลบข้อมูลเมตาได้อย่างง่ายดาย"
    },
    "feature_2": {
      "title": "การควบคุมข้อมูลเมตาที่ครอบคลุม",
      "content": "API มีตัวเลือกมากมายสำหรับการปรับแต่งข้อมูลเมตา ค้นหา ลบ หรืออัปเดตข้อมูลเมตาในไฟล์ได้อย่างง่ายดายโดยใช้คำสั่งพิเศษ"
    },
    "feature_3": {
      "title": "ใช้คุณสมบัติเนทิฟ {{FileFormatUp}}",
      "content": "ใช้ประโยชน์จากฟีเจอร์ข้อมูลเมตาในตัว เช่น EXIF ​​สำหรับรูปภาพ ซึ่งอาจรวมถึงรุ่นของกล้อง ความละเอียด วันที่สร้าง และอื่นๆ"
    },
    "code_1": {
      "title": "อัปเดตแท็กเนื้อเพลงในไฟล์ MP3 (ตัวอย่าง)",
      "content": "ตัวอย่างนี้แสดงวิธีอัปเดตข้อมูลเมตาที่ซ่อนอยู่ในไฟล์ MP3",
      "comment_1": "โหลดไฟล์ลงในตัวสร้างคลาส {{TextMetadata}}",
      "comment_2": "อัปเดตข้อมูลเนื้อเพลง",
      "comment_3": "เพิ่มฟิลด์ที่กำหนดเองให้กับแท็ก",
      "comment_4": "บันทึกผลลัพธ์"
    }
  }
}