{
  "head": {
    "title": "Editar metadatos en archivos {{FileformatCap}} en aplicaciones {{ProgLang}}",
    "description": "{{ProgLang}} API de procesamiento de metadatos para editar información de metadatos en archivos {{FileformatCap}}. Trabaje con estándares de metadatos XMP, EXIF, IPTC, ID3, etc."
  },
  "header": {
    "title": "Actualizar metadatos del archivo {{FileformatCap}} en {{ProgLang}}",
    "description": "Actualice la información de metadatos de todos los documentos, imágenes y formatos de archivos multimedia populares con la ayuda de realizar todas las operaciones de procesamiento de metadatos más necesarias.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Descargue prueba gratis"
  },
  "about": {
    "title": "Acerca de la API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ofrece un conjunto avanzado de funciones de administración de metadatos, lo que permite a los desarrolladores leer, documentar, eliminar, buscar, comparar, reemplazar y exportar fácilmente información de metadatos de imágenes y formatos de documentos sin utilizar ningún software externo. Utilice la API de manipulación de metadatos para editar detalles de metadatos de formatos de archivos PDF, Microsoft Office Word, hojas de cálculo de Excel, presentaciones de PowerPoint, correos electrónicos de Outlook, OneNote, Visio, Project, AutoCAD, Archive y Multimedia junto con la compatibilidad para trabajar con muchas otras funciones de procesamiento de metadatos."
  },
  "formats": {
    "title": "Actualización de propiedades de metadatos desde otros formatos de archivo",
    "description": "API de edición de metadatos de imágenes y documentos multiformato para {{EnvName}}. Recupere metadatos de algunos de los formatos de archivo populares como se indica a continuación"
  },
  "examples": {
    "comment_1": "Editar fecha de creación de {{FileFormatUp}}",
    "comment_2": "establezca el valor de cada propiedad que satisface el predicado:",
    "comment_3": "La propiedad contiene la fecha y hora en que se creó el documento.",
    "comment_4": "actualizar la fecha/hora de creación del archivo si el valor existente tiene más de 3 días",
    "comment_5": "Guardar resultado {{FileFormatUp}}"
  },
  "steps": {
    "title": "Pasos para actualizar metadatos a {{FileFormatUp}} en {{ProgLang}}",
    "content": {
      "title": "[{{ProdFullName}}]({{ProductUrl}}) facilita a los desarrolladores de {{EnvName}} editar información de metadatos en archivos {{FileFormatUp}} desde sus aplicaciones mediante la implementación de unos sencillos pasos.",
      "step_1": "Cargue el archivo {{FileFormatUp}} a través de una instancia de la clase {{TextMetadata}}.",
      "step_2": "Especifique un predicado que se utilizará para filtrar las propiedades de metadatos deseadas.",
      "step_3": "Pase el predicado y el nuevo valor al método {{TextUpdateProperties}}.",
      "step_4": "Guarde los cambios en el disco en formato {{FileFormatUp}}."
    }
  },
  "more_features": {
    "title": "Administrar {{FileFormatUp}} propiedades de metadatos internos para aplicaciones {{EnvName}}",
    "description": "La API {{ProdShortName}} permite a los desarrolladores editar fácilmente los detalles del documento (metadatos) en varios formatos utilizando sus aplicaciones {{EnvName}}. Agregue, actualice, busque y elimine propiedades de documentos mediante programación.",
    "image_description": "Gestión de propiedades de metadatos de documentos",
    "feature_1": {
      "title": "Integración efectiva de metadatos",
      "content": "{{ProdShortName}} simplifica agregar diferentes propiedades a documentos y archivos dentro de sus aplicaciones {{EnvName}}. Los desarrolladores pueden aplicar, actualizar o eliminar fácilmente propiedades de documentos mediante programación."
    },
    "feature_2": {
      "title": "Control preciso de metadatos",
      "content": "La API ofrece amplias opciones para gestionar las propiedades de los documentos. Los desarrolladores pueden encontrar y procesar de manera eficiente cualquier dato oculto colocado en archivos comerciales."
    },
    "feature_3": {
      "title": "Aprovechando las propiedades integradas {{FileFormatUp}}",
      "content": "Dependiendo del formato del documento, los desarrolladores pueden utilizar propiedades existentes como datos EXIF ​​para imágenes. Esto podría incluir información como detalles de la cámara, resolución, fecha de creación y más."
    },
    "code_1": {
      "title": "Actualizar metadatos de letras en un archivo MP3 (ejemplo)",
      "content": "Este ejemplo demuestra la actualización de información oculta (metadatos) en archivos de audio MP3.",
      "comment_1": "Cargar archivo usando la clase {{TextMetadata}}",
      "comment_2": "Actualizar datos de letras",
      "comment_3": "Puede agregar campos personalizados a los metadatos.",
      "comment_4": "Guardar archivo actualizado"
    }
  }
}