{
  "head": {
    "title": "Редагувати метадані файлів {{FileformatCap}} у програмах {{ProgLang}}",
    "description": "API обробки метаданих {{ProgLang}} для редагування інформації метаданих у файлах {{FileformatCap}}. Робота зі стандартами метаданих XMP, EXIF, IPTC, ID3 тощо."
  },
  "header": {
    "title": "Оновити метадані файлу {{FileformatCap}} у {{ProgLang}}",
    "description": "Оновлюйте метадані з усіх популярних документів, зображень і форматів мультимедійних файлів із підтримкою виконання всіх найнеобхідніших операцій обробки метаданих.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажте безкоштовну пробну версію"
  },
  "about": {
    "title": "Про API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує розширений набір функцій керування метаданими, що дозволяє розробникам легко читати, документувати, видаляти, знаходити, порівнювати, замінювати та експортувати інформацію метаданих із зображень і форматів документів без використання будь-яких зовнішнє програмне забезпечення. Використовуйте API обробки метаданих, щоб редагувати деталі метаданих із форматів PDF, Microsoft Office Word, електронних таблиць Excel, презентацій PowerPoint, електронних листів Outlook, OneNote, Visio, Project, AutoCAD, архівних і мультимедійних файлів, а також підтримувати роботу з багатьма іншими функціями обробки метаданих."
  },
  "formats": {
    "title": "Оновлення властивостей метаданих з інших форматів файлів",
    "description": "API редагування метаданих багатоформатних документів і зображень для {{EnvName}}. Отримайте метадані деяких популярних форматів файлів, як зазначено нижче"
  },
  "examples": {
    "comment_1": "Редагувати дату створення {{FileFormatUp}}",
    "comment_2": "встановіть значення кожної властивості, яка задовольняє предикат:",
    "comment_3": "властивість містить дату/час створення документа",
    "comment_4": "оновити дату/час створення файлу, якщо наявне значення старше 3 днів",
    "comment_5": "Зберегти результат {{FileFormatUp}}"
  },
  "steps": {
    "title": "Кроки для оновлення метаданих до {{FileFormatUp}} у {{ProgLang}}",
    "content": {
      "title": "[{{ProdFullName}}]({{ProductUrl}}) дозволяє розробникам {{EnvName}} редагувати метадані файлів {{FileFormatUp}} у своїх програмах, виконавши кілька простих кроків.",
      "step_1": "Завантажте файл {{FileFormatUp}} через екземпляр класу {{TextMetadata}}.",
      "step_2": "Укажіть предикат, який використовуватиметься для фільтрації бажаних властивостей метаданих.",
      "step_3": "Передайте предикат і нове значення в метод {{TextUpdateProperties}}.",
      "step_4": "Збережіть зміни на диску у форматі {{FileFormatUp}}."
    }
  },
  "more_features": {
    "title": "Керування внутрішніми властивостями метаданих {{FileFormatUp}} для програм {{EnvName}}",
    "description": "API {{ProdShortName}} дозволяє розробникам легко редагувати деталі документів (метадані) у різних форматах за допомогою їхніх програм {{EnvName}}. Програмне додавання, оновлення, пошук і видалення властивостей документа.",
    "image_description": "Керування властивостями метаданих документа",
    "feature_1": {
      "title": "Ефективна інтеграція метаданих",
      "content": "{{ProdShortName}} спрощує додавання різних властивостей до документів і файлів у ваших програмах {{EnvName}}. Розробники можуть легко застосувати, оновити або видалити властивості документа програмним шляхом."
    },
    "feature_2": {
      "title": "Точний контроль метаданих",
      "content": "API пропонує широкі можливості для керування властивостями документа. Розробники можуть ефективно знаходити та обробляти будь-які приховані дані, розміщені в бізнес-файлах."
    },
    "feature_3": {
      "title": "Використання вбудованих властивостей {{FileFormatUp}}",
      "content": "Залежно від формату документа розробники можуть використовувати існуючі властивості, наприклад дані EXIF ​​для зображень. Це може містити інформацію про камеру, роздільну здатність, дату створення тощо."
    },
    "code_1": {
      "title": "Оновити метадані пісні у файлі MP3 (приклад)",
      "content": "Цей приклад демонструє оновлення прихованої інформації (метаданих) у аудіофайлах MP3.",
      "comment_1": "Завантажте файл за допомогою класу {{TextMetadata}}",
      "comment_2": "Оновити дані текстів пісень",
      "comment_3": "Ви можете додати власні поля до метаданих",
      "comment_4": "Збережіть оновлений файл"
    }
  }
}