{
  "head": {
    "title": "Редактировать метаданные в файлы {{FileformatCap}} в приложениях {{ProgLang}}.",
    "description": "API обработки метаданных {{ProgLang}} для редактирования информации метаданных в файлах {{FileformatCap}}. Работа со стандартами метаданных XMP, EXIF, IPTC, ID3 и др."
  },
  "header": {
    "title": "Обновить метаданные файла {{FileformatCap}} в {{ProgLang}}",
    "description": "Обновляйте информацию метаданных из всех популярных форматов документов, изображений и мультимедийных файлов с поддержкой выполнения всех наиболее необходимых операций по обработке метаданных.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачать бесплатную пробную версию"
  },
  "about": {
    "title": "Об API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предлагает расширенный набор функций управления метаданными, позволяющий разработчикам легко читать, документировать, удалять, находить, сравнивать, заменять и экспортировать информацию метаданных из изображений и форматов документов без использования каких-либо внешнее программное обеспечение. Используйте API манипуляции метаданными для редактирования деталей метаданных из форматов файлов PDF, Microsoft Office Word, Excel, презентаций PowerPoint, электронных писем Outlook, OneNote, Visio, Project, AutoCAD, архивов и мультимедиа, а также поддержки работы со многими другими функциями обработки метаданных."
  },
  "formats": {
    "title": "Обновление свойств метаданных из файлов других форматов",
    "description": "API редактирования метаданных многоформатных документов и изображений для {{EnvName}}. Получите метаданные некоторых популярных форматов файлов, как указано ниже."
  },
  "examples": {
    "comment_1": "Изменить дату создания {{FileFormatUp}}",
    "comment_2": "установите значение каждого свойства, удовлетворяющего предикату:",
    "comment_3": "свойство содержит дату/время создания документа",
    "comment_4": "обновить дату/время создания файла, если существующее значение старше 3 дней",
    "comment_5": "Сохранить результат {{FileFormatUp}}"
  },
  "steps": {
    "title": "Действия по обновлению метаданных в {{FileFormatUp}} в {{ProgLang}}",
    "content": {
      "title": "[{{ProdFullName}}]({{ProductUrl}}) позволяет разработчикам {{EnvName}} легко редактировать метаданные в файлах {{FileFormatUp}} из своих приложений, выполнив несколько простых шагов.",
      "step_1": "Загрузите файл {{FileFormatUp}} через экземпляр класса {{TextMetadata}}.",
      "step_2": "Укажите предикат, который будет использоваться для фильтрации желаемых свойств метаданных.",
      "step_3": "Передайте предикат и новое значение методу {{TextUpdateProperties}}.",
      "step_4": "Сохраните изменения на диске в формате {{FileFormatUp}}."
    }
  },
  "more_features": {
    "title": "Управление свойствами внутренних метаданных {{FileFormatUp}} для приложений {{EnvName}}",
    "description": "API {{ProdShortName}} позволяет разработчикам легко редактировать детали документа (метаданные) в различных форматах с помощью своих приложений {{EnvName}}. Программно добавляйте, обновляйте, ищите и удаляйте свойства документа.",
    "image_description": "Управление свойствами метаданных документа",
    "feature_1": {
      "title": "Эффективная интеграция метаданных",
      "content": "{{ProdShortName}} упрощает добавление различных свойств к документам и файлам в ваших приложениях {{EnvName}}. Разработчики могут легко применять, обновлять или удалять свойства документа программным способом."
    },
    "feature_2": {
      "title": "Точный контроль метаданных",
      "content": "API предлагает обширные возможности для управления свойствами документа. Разработчики могут эффективно находить и обрабатывать любые скрытые данные, размещенные в бизнес-файлах."
    },
    "feature_3": {
      "title": "Использование встроенных свойств {{FileFormatUp}}",
      "content": "В зависимости от формата документа разработчики могут использовать существующие свойства, такие как данные EXIF ​​для изображений. Сюда может входить такая информация, как сведения о камере, разрешение, дата создания и т. д."
    },
    "code_1": {
      "title": "Обновление метаданных текста песни в файле MP3 (пример)",
      "content": "В этом примере показано обновление скрытой информации (метаданных) в аудиофайлах MP3.",
      "comment_1": "Загрузите файл, используя класс {{TextMetadata}}.",
      "comment_2": "Обновить данные о текстах песен",
      "comment_3": "Вы можете добавлять пользовательские поля в метаданные.",
      "comment_4": "Сохранить обновленный файл"
    }
  }
}