{
  "head": {
    "title": "Java API метаданных — просмотр, чтение, экспорт, редактирование, удаление метаданных документа",
    "description": "API метаданных Java для просмотра, чтения, редактирования, анализа, поиска, удаления, сравнения и экспорта метаданных PDF Word Excel PPTX Outlook Visio Audio Audio Video и документов с изображениями."
  },
  "header": {
    "title": "API манипулирования метаданными для Java",
    "description": "Разрабатывайте Java приложения для создания, просмотра, доступа, обновления, удаления, поиска, сравнения, замены и экспорта метаданных популярных документов и форматов изображений."
  },
  "submenu": {
    "middle": {
      "overview": "Обзор",
      "features": "Функции",
      "support": "Поддержка",
      "livedemo": "Живая демонстрация",
      "pricing": "Ценообразование"
    }
  },
  "overview": {
    "content": {
      "paragraph_1": "GroupDocs.Metadata for Java — это усовершенствованный API управления метаданными для управления метаданными документов, изображений, архивов, торрентов и различных других форматов файлов. Теперь разработчики могут расширять функциональность своих приложений Java, легко добавляя функции просмотра, изменения, удаления, извлечения, поиска, сравнения, замены и экспорта метаданных во всех популярных форматах деловых документов, таких как PDF, Microsoft Office Word, Excel электронные таблицы, PowerPoint презентации и слайды, Outlook электронные письма, Project, Visio диаграммы, OneNote, изображения, AutoCAD, Photoshop, аудио, видео, шрифты OpenType и метафайлы.",
      "paragraph_2": "Библиотека метаданных Java предлагает вам такие функции, как поиск метаданных, замена свойств метаданных, сравнение метаданных поддерживаемых форматов файлов для выявления сходств и различий. Вы также можете редактировать или изменять метаданные для лучшего управления информацией и экспортировать полученную метаинформацию в файл Excel, CSV-файл и DataSet. API обеспечивает всестороннюю поддержку работы со всеми часто используемыми стандартами метаданных, такими как встроенные свойства XMP, EXIF и настраиваемые свойства метаданных в поддерживаемых форматах документов.",
      "paragraph_3": "GroupDocs.Metadata for Java совместима со всеми версиями Java и поддерживает популярные операционные системы (Windows, Linux, Mac OS), способные работать в режиме выполнения Java."
    }
  },
  "tabs": {
    "tab_one": {
      "description": "Ниже приведен обзор GroupDocs.Metadata for Java:",
      "left": {
        "title": "Работа с изображениями",
        "content": {
          "line_1": "XMP Метаданные",
          "line_2": "EXIF Метаданные",
          "line_3": "IPTC-IIM Метаданные",
          "line_4": "PSD Метаданные",
          "line_5": "CAD Метаданные",
          "line_6": "Проанализируйте дополнительные теги IFD"
        }
      },
      "right": {
        "title": "Работа с Audio и Video",
        "content": {
          "line_1": "Определение формата во время выполнения MP3",
          "line_2": "Прочитать Lyrics3 Тег",
          "line_3": "Прочитайте информацию MPEG Audio",
          "line_4": "Прочитайте информацию о заголовке AVI",
          "line_5": "Читайте субтитры Matroska",
          "line_6": "Экспорт данных в формат Excel или CSV"
        }
      }
    },
    "tab_two": {
      "description": "GroupDocs.Metadata for Java поддерживает следующее",
      "formats_url_title": "форматы файлов документов",
      "left": {
        "title": "Microsoft Office"
      },
      "right": {
        "title": "Другие форматы",
        "content": {
          "line_5": "Audio",
          "line_6": "Video",
          "line_9": "Изображения",
          "line_11": "Шрифты OpenType",
          "line_12": "Другие"
        }
      }
    },
    "tab_three": {
      "description": "GroupDocs.Metadata for .NET поддерживает следующие операционные системы, фреймворки и менеджеры пакетов:",
      "left": {
        "title": "операционные системы",
        "content": {
          "line_1": "Windows Desktop",
          "line_2": "Windows Server",
          "line_3": "Windows Azure",
          "line_4": "Linux"
        },
        "title_2": "Поддерживаемые платформы",
        "content_2": {
          "line_1": ".NET Framework 2.0 или выше",
          "line_2": "Mono Framework 1.2 или выше",
          "line_3": ".NET Standard 2.0",
          "line_4": ".NET Core 2.0",
          "line_5": ".NET Core 2.1"
        }
      },
      "right": {
        "title": "Менеджеры пакетов",
        "content": {
          "line_1": "* NuGet"
        },
        "title_2": "Среды разработки",
        "content_2": {
          "line_1": "* Microsoft Visual Studio",
          "line_2": "* Xamarin.Android",
          "line_3": "* Xamarin.IOS",
          "line_4": "* Xamarin.Mac",
          "line_5": "* MonoDevelop"
        }
      }
    }
  },
  "features": {
    "title": "GroupDocs.Metadata for Java Характеристики",
    "feature_1": {
      "content": "Управляйте встроенными и настраиваемыми метаданными и извлекайте метаданные торрентов и форматов архивов"
    },
    "feature_2": {
      "content": "Доступ к скрытым данным и их удаление в Microsoft Word, Excel, PowerPoint и PDF"
    },
    "feature_3": {
      "content": "Определение типа файла документа во время выполнения"
    },
    "feature_4": {
      "content": "Идентификация/удаление цифровых подписей в Word, Excel, PDF"
    },
    "feature_5": {
      "content": "Определите защиту документов паролем в Word, Excel, PowerPoint и PDF"
    },
    "feature_6": {
      "content": "Получайте миниатюры и предварительные просмотры изображений поддерживаемых форматов и поддержка мультимедийных контейнеров Matroska"
    },
    "feature_7": {
      "content": "Извлечение текстовых метаданных из PNG файлов изображений"
    },
    "feature_8": {
      "content": "Поддерживает перечисление любого типа метаданных и чтение метаданных файлов шрифтов OpenType"
    },
    "feature_9": {
      "content": "Прочитайте свойство метаданных с помощью заданного ключа для любого поддерживаемого формата"
    },
    "feature_10": {
      "content": "Получение/удаление метаданных сообщений электронной почты и удаление вложений"
    },
    "feature_11": {
      "content": "Читайте субтитры Matroska и извлекайте метаданные файлов Audio и Video"
    },
    "feature_12": {
      "content": "Создавайте предварительные просмотры изображений для файлов EPUB, CAD, EML и MSG"
    },
    "feature_13": {
      "content": "Определите различия или сходства в метаданных поддерживаемых форматов путем сравнения"
    },
    "feature_14": {
      "content": "Свойства поиска в метаданных документа, EXIF и XMP"
    },
    "feature_15": {
      "content": "Замените свойства метаданных Word, Excel, PowerPoint и PDF"
    },
    "feature_16": {
      "content": "Экспорт метаданных поддерживаемых форматов файлов в Excel, CSV или DataSet"
    },
    "feature_17": {
      "content": "Добавьте или обновите свойства метаданных XMP и EXIF произвольных типов с помощью API поиска"
    },
    "feature_18": {
      "content": "Управление свойствами метаданных изображения и удаление информации о местоположении фотографии"
    },
    "feature_19": {
      "content": "Удалить метаданные и комментарии из отчетов и документов"
    },
    "feature_20": {
      "content": "Извлечение метаданных из файлов Microsoft Excel, начиная с Excel 95"
    },
    "feature_21": {
      "content": "Снижение потребления памяти до PDF, Excel и форматов изображений"
    },
    "feature_22": {
      "content": "Обновите свойства метаданных EXIF в файлах WEBP, PNG и PSD"
    },
    "feature_23": {
      "content": "Извлеките свойства метаданных XMP в файлы MOV, MP3 и WEBP"
    },
    "feature_24": {
      "content": "Добавление, обновление и удаление пакетов метаданных IPTC в TIFF изображениях"
    },
    "feature_25": {
      "content": "Добавление, обновление и удаление пакетов метаданных EXIF в JPEG 2000 изображениях"
    },
    "feature_26": {
      "content": "Чтение EXIF тегов и XMP свойств метаданных из форматов изображений HEIC/HEIF"
    },
    "feature_27": {
      "content": "Чтение метаданных из зашифрованных файлов Microsoft Project"
    }
  },
  "more_feature": {
    "feature_1": {
      "title": "Эффективное получение свойств метаданных",
      "content": "С помощью API GroupDocs.Metadata for Java можно довольно эффективно получать свойства метаданных поддерживаемых форматов файлов. Код для этого довольно прост и понятен. Ниже приведен пример, показывающий, как легко получить свойства метаданных файла MP3 с помощью Java:"
    },
    "feature_2": {
      "title": "Извлечение скрытых данных для манипуляций",
      "content": "GroupDocs.Metadata for Java предоставляет комплексный способ получения и удаления скрытых данных из файлов Microsoft Word, Excel и PowerPoint. То же самое можно сделать для документов PDF. Можно манипулировать комментариями, объединять поля, скрытые страницы, поля форм, аннотации и многое другое."
    }
  },
  "solutions": {
    "title": "GroupDocs.Metadata предлагает API просмотра документов для других популярных сред разработки"
  }
}