{
  "head": {
    "title": ".NET API для чтения, просмотра, извлечения, удаления и экспорта метаданных",
    "description": "API метаданных C# .NET для чтения, записи, редактирования, анализа, поиска, извлечения, удаления, сравнения и экспорта метаданных PDF Word Excel PPTX Outlook Audio Video и изображений."
  },
  "header": {
    "title": ".NET API для управления метаданными и манипулирования ими",
    "description": "Создавайте .NET приложения для чтения, редактирования, удаления, извлечения, поиска, сравнения, замены и экспорта метаданных всех популярных документов и форматов файлов изображений."
  },
  "submenu": {
    "middle": {
      "overview": "Обзор",
      "features": "Функции",
      "support": "Поддержка",
      "livedemo": "Живая демонстрация",
      "pricing": "Ценообразование"
    }
  },
  "overview": {
    "content": {
      "paragraph_1": "API GroupDocs.Metadata for .NET легко интегрируется с приложениями на основе C#, ASP .NET и другими .NET и помогает конечным пользователям манипулировать метаданными из различных изображений, документов и других форматов медиафайлов без установки внешнего программного обеспечения. Библиотека метаданных .NET поддерживает создание инструментов для быстрого добавления функций просмотра, редактирования, удаления, извлечения, сравнения и экспорта метаданных в ряд стандартных отраслевых форматов документов, таких как PDF, Microsoft Office Word, Excel электронные таблицы, PowerPoint презентации, Outlook электронные письма, Project, Visio диаграммы, OneNote, изображения, AutoCAD, Photoshop, аудио, видео и метафайлы.",
      "paragraph_2": "API метаданных очень гибкий и простой в использовании. Он получает файл документа в качестве входных данных, анализирует метаданные, позволяет выполнять поддерживаемые операции с метаданными и сохранять измененный файл для быстрого доступа к нему в будущем. Он работает с наиболее известными стандартами метаданных, такими как встроенные XMP, EXIF, IPTC, блоки ресурсов изображений, ID3 и настраиваемые свойства метаданных. С помощью API GroupDocs.Metadata for .NET вы также можете сравнить два документа, чтобы определить различия и сходства, присутствующие в их свойствах метаданных. Можно также экспортировать метаданные необходимых документов в формат Excel, CSV или DataSet.",
      "paragraph_3": "GroupDocs.Metadata for .NET можно использовать для разработки приложений в любой среде разработки, ориентированной на платформу .NET. Он совместим со всеми языками на базе .NET и поддерживает популярные операционные системы (Windows, Linux, Mac OS), в которых можно установить фреймворки Mono или .NET (включая .NET Core)."
    }
  },
  "tabs": {
    "tab_one": {
      "description": "Ниже приведен обзор GroupDocs.Metadata for .NET:",
      "left": {
        "title": "Работа с изображениями",
        "content": {
          "line_1": "XMP Метаданные",
          "line_2": "EXIF Метаданные",
          "line_3": "IPTC-IIM Метаданные",
          "line_4": "PSD Метаданные",
          "line_5": "CAD Метаданные",
          "line_6": "Проанализируйте дополнительные теги IFD"
        }
      },
      "right": {
        "title": "Работа с Audio и Video",
        "content": {
          "line_1": "Определение формата во время выполнения MP3",
          "line_2": "Прочитать Lyrics3 Тег",
          "line_3": "Прочитайте информацию MPEG Audio",
          "line_4": "Прочитайте информацию о заголовке AVI",
          "line_5": "Читайте субтитры Matroska",
          "line_6": "Экспорт данных в формат Excel или CSV"
        }
      }
    },
    "tab_two": {
      "description": "GroupDocs.Metadata for .NET поддерживает следующее",
      "formats_url_title": "форматы файлов документов",
      "left": {
        "title": "Microsoft Office"
      },
      "right": {
        "title": "Другие форматы",
        "content": {
          "line_5": "Audio",
          "line_6": "Video",
          "line_9": "Изображения",
          "line_11": "Шрифты OpenType",
          "line_12": "Другие"
        }
      }
    },
    "tab_three": {
      "description": "GroupDocs.Metadata for .NET поддерживает следующие операционные системы, фреймворки и менеджеры пакетов:",
      "left": {
        "title": "операционные системы",
        "content": {
          "line_1": "Windows Desktop",
          "line_2": "Windows Server",
          "line_3": "Windows Azure",
          "line_4": "Linux"
        },
        "title_2": "Поддерживаемые платформы",
        "content_2": {
          "line_1": ".NET Framework 2.0 или выше",
          "line_2": "Mono Framework 1.2 или выше",
          "line_3": ".NET Standard 2.0",
          "line_4": ".NET Core 2.0",
          "line_5": ".NET Core 2.1"
        }
      },
      "right": {
        "title": "Менеджеры пакетов",
        "content": {
          "line_1": "* NuGet"
        },
        "title_2": "Среды разработки",
        "content_2": {
          "line_1": "* Microsoft Visual Studio",
          "line_2": "* Xamarin.Android",
          "line_3": "* Xamarin.IOS",
          "line_4": "* Xamarin.Mac",
          "line_5": "* MonoDevelop"
        }
      }
    }
  },
  "features": {
    "title": "GroupDocs.Metadata for .NET Характеристики",
    "feature_1": {
      "content": "Определите встроенные и настраиваемые метаданные"
    },
    "feature_2": {
      "content": "Извлечение и удаление скрытых данных в Microsoft Word, Excel, PowerPoint и PDF"
    },
    "feature_3": {
      "content": "Распознавание типа файла документа во время выполнения"
    },
    "feature_4": {
      "content": "Возможность обнаруживать/удалять цифровые подписи"
    },
    "feature_5": {
      "content": "Защита идентификационных паролей и поддержка мультимедийного контейнера Matroska"
    },
    "feature_6": {
      "content": "Извлечение миниатюр и рендеринг изображений для предварительного просмотра в поддерживаемых форматах"
    },
    "feature_7": {
      "content": "Определите тип MIME определенного файла или файлового потока"
    },
    "feature_8": {
      "content": "Создавайте предварительные просмотры изображений для файлов EPUB, CAD, EML и MSG"
    },
    "feature_9": {
      "content": "Используйте заданный ключ для чтения свойств метаданных поддерживаемых форматов"
    },
    "feature_10": {
      "content": "Чтение метаданных сообщений электронной почты и анализ файлов шрифтов OpenType"
    },
    "feature_11": {
      "content": "Читайте субтитры Matroska и извлекайте метаданные файлов Audio и Video"
    },
    "feature_12": {
      "content": "Получите метаданные архивных форматов и торрентов"
    },
    "feature_13": {
      "content": "Сравните свойства метаданных поддерживаемых форматов и отличия или сходства идентичности"
    },
    "feature_14": {
      "content": "Поиск свойств метаданных файлов и перечисление метаданных любого типа"
    },
    "feature_15": {
      "content": "Заменить свойства метаданных поддерживаемых форматов файлов"
    },
    "feature_16": {
      "content": "Извлечение метаданных из файлов Microsoft Excel, начиная с Excel 95"
    },
    "feature_17": {
      "content": "Найдите фотографии, сделанные на определенной камере"
    },
    "feature_18": {
      "content": "Импорт свойств метаданных изображений и удаление информации о местоположении из фотографий"
    },
    "feature_19": {
      "content": "Удаление метаданных и комментариев из отчетов и документов"
    },
    "feature_20": {
      "content": "Извлечение текстовых метаданных из PNG файлов изображений"
    },
    "feature_21": {
      "content": "Снижение потребления памяти документами и изображениями"
    },
    "feature_22": {
      "content": "Обновите свойства метаданных EXIF в файлах WEBP, PNG и PSD"
    },
    "feature_23": {
      "content": "Извлеките свойства метаданных XMP в файлы MOV, MP3 и WEBP"
    },
    "feature_24": {
      "content": "Добавление, обновление и удаление пакетов метаданных IPTC в TIFF изображениях"
    }
  },
  "more_feature": {
    "feature_1": {
      "title": "Быстрое получение свойств метаданных",
      "content": "Используя API GroupDocs.Metadata for .NET, манипулировать любыми метаданными поддерживаемых форматов файлов довольно просто. Следующий фрагмент кода показывает, как легко удалить метаданные Photoshop из файла JPEG с помощью C#:"
    },
    "feature_2": {
      "title": "Извлечение скрытых данных и манипулирование ими",
      "content": "GroupDocs.Metadata for .NET предоставляет удобный механизм для получения и удаления скрытых данных в документах PDF, а также Microsoft Word, Excel и PowerPoint. Можно манипулировать комментариями, объединять поля, скрытые страницы, поля форм, аннотации и многое другое."
    }
  },
  "solutions": {
    "title": "GroupDocs.Metadata предлагает API просмотра документов для других популярных сред разработки"
  }
}