{
  "nodejs-java": {
    "content": "Node.js через рішення Java для керування та маніпулювання різними типами метаданих у популярних форматах файлів, таких як PDF-файли, документи Office або зображення."
  },
  "head": {
    "title": "Бібліотека Node.js для маніпулювання метаданими файлів",
    "description": "Покращуйте програми Node.js, аналізуючи, порівнюючи, редагуючи, видаляючи та експортуючи метадані популярних форматів файлів, як-от PDF, Word, Excel тощо."
  },
  "header": {
    "title": "Управління метаданими документів Node.js",
    "description": "Керуйте метаданими в популярних форматах документів і зображень за допомогою Node.js."
  },
  "submenu": {
    "middle": {
      "overview": "Огляд",
      "features": "особливості",
      "support": "Підтримка",
      "livedemo": "Жива демо",
      "pricing": "Ціноутворення"
    }
  },
  "overview": {
    "content": {
      "paragraph_1": "GroupDocs.Metadata для Node.js — це вдосконалена бібліотека, яка дає змогу керувати метаданими в різних форматах файлів. Інтегруйте функції перегляду, редагування, видалення, пошуку, порівняння, заміни та експорту метаданих у свої програми Node.js. Підтримувані формати включають такі популярні бізнес-документи, як PDF, Microsoft Office (Word, Excel, PowerPoint), електронні листи Outlook, Project, діаграми Visio, OneNote, зображення (включаючи PSD, CAD), аудіо, відео, шрифти OpenType і метафайли.",
      "paragraph_2": "Ця бібліотека пропонує комплексні функції, такі як пошук метаданих, заміна, порівняння властивостей і вилучення інформації. Ви можете експортувати отримані метадані у формати Excel, CSV або DataSet. Він підтримує широко використовувані стандарти метаданих, такі як вбудовані, XMP, EXIF ​​і власні властивості в підтримуваних форматах документів.",
      "paragraph_3": "GroupDocs.Metadata для Node.js сумісна з усіма версіями Node.js і без проблем працює в популярних операційних системах (Windows, Linux, macOS), які підтримують середовище виконання Node.js."
    }
  },
  "tabs": {
    "tab_one": {
      "description": "Можливості керування метаданими Node.js:",
      "left": {
        "title": "Робота з зображеннями",
        "content": {
          "line_1": "Метадані XMP",
          "line_2": "Метадані EXIF",
          "line_3": "Метадані IPTC-IIM",
          "line_4": "Метадані PSD",
          "line_5": "Метадані CAD",
          "line_6": "Проаналізуйте додаткові теги IFD"
        }
      },
      "right": {
        "title": "Робота з аудіо та відео",
        "content": {
          "line_1": "Виявлення формату MP3 під час виконання",
          "line_2": "Читайте тег Lyrics3",
          "line_3": "Прочитати аудіоінформацію MPEG",
          "line_4": "Прочитайте інформацію про заголовок AVI",
          "line_5": "Читайте субтитри Matroska",
          "line_6": "Експортуйте дані в Excel або CSV"
        }
      }
    },
    "tab_two": {
      "description": "Підтримувані формати GroupDocs.Metadata для Node.js:",
      "formats_url_title": "формати файлів документів",
      "left": {
        "title": "Microsoft Office"
      },
      "right": {
        "title": "Інші формати",
        "content": {
          "line_5": "Аудіо",
          "line_6": "відео",
          "line_9": "Зображення",
          "line_11": "Шрифти OpenType",
          "line_12": "інші"
        }
      }
    },
    "tab_three": {
      "description": "GroupDocs.Metadata для Node.js Підтримувані операційні системи, фреймворки та менеджери пакетів:",
      "left": {
        "title": "Операційні системи",
        "content": {
          "line_1": "Робочий стіл Microsoft Windows",
          "line_2": "Microsoft Windows Server",
          "line_3": "Linux",
          "line_4": "MacOS"
        },
        "title_2": "Підтримувані фреймворки",
        "content_2": {
          "line_1": "Node.js 16+ і J2SE 8.0 (1.8)+"
        }
      },
      "right": {
        "title": "Середовища розробки",
        "content": {
          "line_1": "* Атом",
          "line_2": "* Код Visual Studio",
          "line_3": "* Будь-який інший текстовий редактор"
        },
        "title_2": "Інструмент автоматизації збірки",
        "content_2": {
          "line_1": "* НПМ"
        }
      }
    }
  },
  "features": {
    "title": "GroupDocs.Metadata для функцій Node.js",
    "feature_1": {
      "content": "Використовуйте широкі можливості для маніпулювання вбудованими та спеціальними метаданими"
    },
    "feature_2": {
      "content": "Отримайте доступ і видаліть приховані дані, вбудовані в PDF, MS Word, Excel, PowerPoint..."
    },
    "feature_3": {
      "content": "Динамічно визначте тип файлу під час виконання за допомогою Node.js."
    },
    "feature_4": {
      "content": "Визначайте та видаляйте цифрові підписи в PDF-файлах і документах Office."
    },
    "feature_5": {
      "content": "Виявлення захисту паролем, застосованого до документів PDF і MS Word, Excel, PowerPoint."
    },
    "feature_6": {
      "content": "Отримайте мініатюри та попередній перегляд зображень для підтримуваних форматів файлів і підтримку мультимедійного контейнера Matroska"
    },
    "feature_7": {
      "content": "Видобувайте текстові метадані безпосередньо з файлів зображень PNG за допомогою Node.js"
    },
    "feature_8": {
      "content": "Перерахуйте будь-який тип метаданих і керуйте метаданими файлів шрифтів OpenType"
    },
    "feature_9": {
      "content": "Аналізуйте певні властивості метаданих, використовуючи визначені ключі для будь-якого підтримуваного формату"
    },
    "feature_10": {
      "content": "Маніпулювати метаданими та вкладеннями в повідомленнях електронної пошти"
    },
    "feature_11": {
      "content": "Доступ до субтитрів і метаданих Matroska в аудіо- та відеофайлах"
    },
    "feature_12": {
      "content": "Створіть попередній перегляд зображень для файлів MSG, CAD, EML або EPUB"
    },
    "feature_13": {
      "content": "Порівнюйте та аналізуйте будь-які зміни в метаданих у підтримуваних форматах файлів"
    },
    "feature_14": {
      "content": "Збирайте властивості метаданих документа, наприклад EXIF ​​або XMP"
    },
    "feature_15": {
      "content": "Керуйте метаданими в PDF, Word, Excel, PowerPoint та інших форматах"
    },
    "feature_16": {
      "content": "Зберігайте метадані з підтримуваних файлів у форматі Excel, CSV або DataSet"
    },
    "feature_17": {
      "content": "Використовуйте Search API, щоб додати або оновити властивості метаданих XMP і EXIF"
    },
    "feature_18": {
      "content": "Керуйте метаданими в зображеннях, включаючи інформацію про місцезнаходження фотографій"
    },
    "feature_19": {
      "content": "Очистіть бізнес-звіти та документи від будь-яких метаданих і коментарів"
    },
    "feature_20": {
      "content": "Отримайте метадані з електронних таблиць Microsoft Excel, починаючи з Excel 95"
    },
    "feature_21": {
      "content": "Зробіть ваш PDF, Excel і формати зображень менш споживаючими пам’ять"
    },
    "feature_22": {
      "content": "Правильний вміст метаданих EXIF ​​у WEBP, PNG або PSD"
    },
    "feature_23": {
      "content": "Отримайте вузли метаданих XMP із файлів MOV, MP3 і WEBP"
    },
    "feature_24": {
      "content": "Маніпулювання пакетами метаданих IPTC у зображеннях TIFF"
    },
    "feature_25": {
      "content": "Додайте, оновіть або видаліть дані EXIF ​​у зображеннях JPEG2000"
    },
    "feature_26": {
      "content": "Керуйте тегами EXIF ​​і метаданими XMP для зображень HEIC/HEIF"
    },
    "feature_27": {
      "content": "Отримайте всі метадані, приховані в зашифрованих файлах Microsoft Project"
    }
  },
  "more_feature": {
    "feature_1": {
      "title": "Ефективна маніпуляція метаданими в Node.js",
      "content": "GroupDocs.Metadata надає комплексну бібліотеку Node.js для оптимізованого керування метаданими в різних форматах файлів. Отримання, маніпулювання та вилучення властивостей метаданих стає легким за допомогою Node.js API. Ось приклад, який демонструє, як отримати метадані з файлу MP3 за допомогою Node.js: (приклад коду, що демонструє синтаксис JavaScript):"
    },
    "feature_2": {
      "title": "Спрощене вилучення даних за допомогою Node.js",
      "content": "Бібліотека GroupDocs.Metadata для Node.js дає змогу легко отримувати певні приховані метадані. Це спрощує доступ до метаданих і обробку документів PDF, Microsoft Word, Excel і PowerPoint у ваших програмах Node.js. Керуйте вмістом коментарів, прихованих сторінок, полів форм, анотацій тощо."
    }
  },
  "solutions": {
    "title": "GroupDocs.Metadata пропонує API обробки даних для інших популярних середовищ розробки"
  }
}