{
  "head": {
    "title": ".NET, Java API и онлайн приложения за манипулиране на метаданни от GroupDocs",
    "description": "API на метаданни на документа, роден в C # .NET & Java. Четете, пишете, редактирайте и сравнявайте мета информация от всички популярни формати. Анализирайте и експортирайте метаданни."
  },
  "header": {
    "title": "Решение за управление на метаданни на документи",
    "description": "API и приложения за четене, редактиране, замяна и премахване на метаданни на документи, изображения и други файлови формати на популярни платформи."
  },
  "apis": {
    "highcode": {
      "title": "GroupDocs.Metadata High Code API включват",
      "label": "Виж всички High Code API",
      "net": {
        "content": "Native .NET API за динамично четене, писане, редактиране и премахване на мета информация от Microsoft Office, PDF, мултимедия, изображения и различни други файлови формати."
      },
      "java": {
        "content": "Java API за редактиране и манипулиране на метаданни на документи, изображения, видео файлове и различни други файлови формати."
      }
    },
    "lowcode": {
      "title": "GroupDocs.Metadata Low Code API включват",
      "label": "Виж всички Low Code API",
      "curl": {
        "content": "Работа с CurL REST пълна метаданни манипулиране API за управление на метаданни информация на PDF, Word, Excel, Презентации, изображения и мултимедиен файл във вашите приложения."
      },
      "net": {
        "content": "Използвайте метаданни REST API с .NET SDK за добавяне, редактиране, извличане, търсене и изтриване на метаданни от формати на документи в .NET приложения."
      },
      "java": {
        "content": "Подобрете Java приложенията си с мощни функции за управление на метаданни, като използвате Metadata SDK for Java."
      }
    },
    "nocode": {
      "title": "GroupDocs.Metadata No Code Приложенията включват",
      "label": "Виж всички No Code Приложения",
      "total": {
        "content": "Безплатно приложение за преглед и редактиране на метаданни на Word, Excel, PDF, PowerPoint и повече от 50 вида документи."
      },
      "docx": {
        "content": "Безплатен онлайн преглед на метаданни и редактор за MS Word документи."
      },
      "pdf": {
        "content": "Преглеждайте или редактирайте информацията за метаданните на PDF документи онлайн."
      }
    }
  }
}