{
  "nodejs-java": {
    "content": "Node.js ผ่านโซลูชัน Java เพื่อควบคุมและจัดการข้อมูลเมตาประเภทต่างๆ ในรูปแบบไฟล์ยอดนิยม เช่น PDF เอกสาร Office หรือรูปภาพ"
  },
  "head": {
    "title": "ไลบรารี Node.js เพื่อจัดการข้อมูลเมตาของไฟล์",
    "description": "ปรับปรุงแอปพลิเคชัน Node.js โดยการวิเคราะห์ เปรียบเทียบ แก้ไข ลบ และส่งออกข้อมูลเมตาของรูปแบบไฟล์ยอดนิยม เช่น PDF, Word, Excel เป็นต้น"
  },
  "header": {
    "title": "เอกสารการจัดการข้อมูลเมตา Node.js",
    "description": "จัดการข้อมูลเมตาในรูปแบบเอกสารและรูปภาพยอดนิยมโดยใช้ Node.js"
  },
  "submenu": {
    "middle": {
      "overview": "ภาพรวม",
      "features": "คุณสมบัติ",
      "support": "สนับสนุน",
      "livedemo": "การสาธิตสด",
      "pricing": "ราคา"
    }
  },
  "overview": {
    "content": {
      "paragraph_1": "GroupDocs.Metadata สำหรับ Node.js เป็นไลบรารีขั้นสูงที่ช่วยให้คุณจัดการข้อมูลเมตาภายในรูปแบบไฟล์ต่างๆ ผสานรวมฟังก์ชันการดู แก้ไข ลบ ค้นหา เปรียบเทียบ แทนที่ และส่งออกข้อมูลเมตาลงในแอปพลิเคชัน Node.js ของคุณ รูปแบบที่รองรับ ได้แก่ เอกสารทางธุรกิจยอดนิยม เช่น PDF, Microsoft Office (Word, Excel, PowerPoint), อีเมล Outlook, โครงการ, ไดอะแกรม Visio, OneNote, รูปภาพ (รวมถึง PSD, CAD), เสียง, วิดีโอ, ฟอนต์ OpenType และเมตาไฟล์",
      "paragraph_2": "ไลบรารีนี้นำเสนอคุณสมบัติที่ครอบคลุม เช่น การค้นหาข้อมูลเมตา การแทนที่ การเปรียบเทียบคุณสมบัติ และการดึงข้อมูล คุณสามารถส่งออกข้อมูลเมตาที่ดึงมาเป็นรูปแบบ Excel, CSV หรือชุดข้อมูลได้ รองรับมาตรฐานเมตาดาต้าที่ใช้กันทั่วไป เช่น คุณสมบัติในตัว, XMP, EXIF ​​และแบบกำหนดเองภายในรูปแบบเอกสารที่รองรับ",
      "paragraph_3": "GroupDocs.Metadata สำหรับ Node.js เข้ากันได้กับ Node.js เวอร์ชันทั้งหมด และทำงานได้อย่างราบรื่นบนระบบปฏิบัติการยอดนิยม (Windows, Linux, macOS) ที่รองรับรันไทม์ Node.js"
    }
  },
  "tabs": {
    "tab_one": {
      "description": "ความสามารถในการจัดการข้อมูลเมตาของ Node.js:",
      "left": {
        "title": "การทำงานกับรูปภาพ",
        "content": {
          "line_1": "ข้อมูลเมตา XMP",
          "line_2": "ข้อมูลเมตา EXIF",
          "line_3": "ข้อมูลเมตา IPTC-IIM",
          "line_4": "ข้อมูลเมตา PSD",
          "line_5": "ข้อมูลเมตา CAD",
          "line_6": "แยกวิเคราะห์แท็ก IFD เพิ่มเติม"
        }
      },
      "right": {
        "title": "การทำงานกับเสียงและวิดีโอ",
        "content": {
          "line_1": "การตรวจจับรูปแบบ MP3 รันไทม์",
          "line_2": "อ่านเนื้อเพลง 3 แท็ก",
          "line_3": "อ่านข้อมูลเสียง MPEG",
          "line_4": "อ่านข้อมูลส่วนหัวของ AVI",
          "line_5": "อ่านคำบรรยาย Matroska",
          "line_6": "ส่งออกข้อมูลไปยัง Excel หรือ CSV"
        }
      }
    },
    "tab_two": {
      "description": "GroupDocs.Metadata สำหรับ Node.js รูปแบบที่รองรับ:",
      "formats_url_title": "รูปแบบไฟล์เอกสาร",
      "left": {
        "title": "ไมโครซอฟต์ ออฟฟิศ"
      },
      "right": {
        "title": "รูปแบบอื่นๆ",
        "content": {
          "line_5": "เสียง",
          "line_6": "วีดีโอ",
          "line_9": "รูปภาพ",
          "line_11": "แบบอักษร OpenType",
          "line_12": "คนอื่น"
        }
      }
    },
    "tab_three": {
      "description": "GroupDocs.Metadata สำหรับ Node.js ระบบปฏิบัติการ กรอบงาน และตัวจัดการแพ็คเกจที่รองรับ:",
      "left": {
        "title": "ระบบปฏิบัติการ",
        "content": {
          "line_1": "ไมโครซอฟต์วินโดวส์เดสก์ท็อป",
          "line_2": "ไมโครซอฟต์วินโดวส์เซิร์ฟเวอร์",
          "line_3": "ลินุกซ์",
          "line_4": "แมคโอเอส"
        },
        "title_2": "กรอบการทำงานที่รองรับ",
        "content_2": {
          "line_1": "Node.js 16+ และ J2SE 8.0 (1.8)+"
        }
      },
      "right": {
        "title": "สภาพแวดล้อมการพัฒนา",
        "content": {
          "line_1": "* อะตอม",
          "line_2": "* รหัส Visual Studio",
          "line_3": "* โปรแกรมแก้ไขข้อความอื่น ๆ"
        },
        "title_2": "สร้างเครื่องมืออัตโนมัติ",
        "content_2": {
          "line_1": "* เอ็นพีเอ็ม"
        }
      }
    }
  },
  "features": {
    "title": "GroupDocs.Metadata สำหรับฟีเจอร์ Node.js",
    "feature_1": {
      "content": "ใช้ประโยชน์จากความสามารถที่ครอบคลุมในการจัดการข้อมูลเมตาในตัวและแบบกำหนดเอง"
    },
    "feature_2": {
      "content": "เข้าถึงและลบข้อมูลที่ซ่อนอยู่ใน PDF, MS Word, Excel, PowerPoint..."
    },
    "feature_3": {
      "content": "ตรวจจับประเภทไฟล์แบบไดนามิกขณะรันไทม์โดยใช้ Node.js"
    },
    "feature_4": {
      "content": "ระบุและลบลายเซ็นดิจิทัลที่มีอยู่ใน PDF และเอกสาร Office"
    },
    "feature_5": {
      "content": "ตรวจจับการป้องกันด้วยรหัสผ่านที่ใช้กับเอกสาร PDF และ MS Word, Excel, PowerPoint"
    },
    "feature_6": {
      "content": "ดึงภาพขนาดย่อและตัวอย่างรูปภาพสำหรับรูปแบบไฟล์ที่รองรับและรองรับ Matroska Multimedia Container"
    },
    "feature_7": {
      "content": "แยกข้อมูลเมตาของข้อความโดยตรงจากไฟล์ภาพ PNG โดยใช้ Node.js"
    },
    "feature_8": {
      "content": "ระบุประเภทข้อมูลเมตาและควบคุมข้อมูลเมตาของไฟล์ฟอนต์ OpenType"
    },
    "feature_9": {
      "content": "วิเคราะห์คุณสมบัติเมทาดาทาเฉพาะโดยใช้คีย์ที่กำหนดไว้สำหรับรูปแบบที่รองรับ"
    },
    "feature_10": {
      "content": "จัดการข้อมูลเมตาและไฟล์แนบในข้อความอีเมล"
    },
    "feature_11": {
      "content": "เข้าถึงคำบรรยาย Matroska และข้อมูลเมตาในไฟล์เสียงและวิดีโอ"
    },
    "feature_12": {
      "content": "สร้างการแสดงตัวอย่างรูปภาพสำหรับไฟล์ MSG, CAD, EML หรือ EPUB"
    },
    "feature_13": {
      "content": "เปรียบเทียบและวิเคราะห์การเปลี่ยนแปลงใดๆ ในข้อมูลเมตาในรูปแบบไฟล์ที่รองรับ"
    },
    "feature_14": {
      "content": "รวบรวมคุณสมบัติเมทาดาทาของเอกสาร เช่น EXIF ​​หรือ XMP"
    },
    "feature_15": {
      "content": "จัดการข้อมูลเมตาในรูปแบบ PDF, Word, Excel, PowerPoint และรูปแบบอื่นๆ"
    },
    "feature_16": {
      "content": "บันทึกข้อมูลเมตาจากไฟล์ที่รองรับไปยังเอาต์พุต Excel, CSV หรือ DataSet"
    },
    "feature_17": {
      "content": "ใช้ Search API เพื่อเพิ่มหรืออัปเดตคุณสมบัติข้อมูลเมตา XMP และ EXIF"
    },
    "feature_18": {
      "content": "ควบคุมข้อมูลเมตาในรูปภาพรวมถึงข้อมูลตำแหน่งของรูปภาพ"
    },
    "feature_19": {
      "content": "ล้างรายงานและเอกสารทางธุรกิจจากข้อมูลเมตาและความคิดเห็น"
    },
    "feature_20": {
      "content": "รับข้อมูลเมตาจาก Microsoft Excel Spreadsheets โดยเริ่มจาก Excel 95"
    },
    "feature_21": {
      "content": "ทำให้รูปแบบ PDF, Excel และรูปภาพของคุณใช้หน่วยความจำน้อยลง"
    },
    "feature_22": {
      "content": "เนื้อหาที่ถูกต้องของข้อมูลเมตา EXIF ​​ใน WEBP, PNG หรือ PSD"
    },
    "feature_23": {
      "content": "รับโหนดข้อมูลเมตา XMP จากไฟล์ MOV, MP3 และ WEBP"
    },
    "feature_24": {
      "content": "จัดการแพ็คเกจข้อมูลเมตา IPTC ในภาพ TIFF"
    },
    "feature_25": {
      "content": "เพิ่ม อัปเดต หรือลบข้อมูล EXIF ​​ในภาพ JPEG2000"
    },
    "feature_26": {
      "content": "ควบคุมแท็ก EXIF ​​​​และข้อมูลเมตา XMP สำหรับรูปภาพ HEIC/HEIF"
    },
    "feature_27": {
      "content": "รับข้อมูลเมตาทั้งหมดที่ซ่อนอยู่ในไฟล์โครงการ Microsoft ที่เข้ารหัส"
    }
  },
  "more_feature": {
    "feature_1": {
      "title": "การจัดการข้อมูลเมตาที่มีประสิทธิภาพใน Node.js",
      "content": "GroupDocs.Metadata มีไลบรารี Node.js ที่ครอบคลุมสำหรับการจัดการข้อมูลเมตาภายในรูปแบบไฟล์ต่างๆ ที่มีประสิทธิภาพ การเรียก จัดการ และแยกคุณสมบัติข้อมูลเมตากลายเป็นเรื่องง่ายด้วย Node.js API นี่คือตัวอย่างที่สาธิตวิธีรับข้อมูลเมตาจากไฟล์ MP3 โดยใช้ Node.js: (ตัวอย่างโค้ดที่แสดงไวยากรณ์ JavaScript):"
    },
    "feature_2": {
      "title": "การแยกข้อมูลแบบง่ายด้วย Node.js",
      "content": "ไลบรารี GroupDocs.Metadata สำหรับ Node.js ช่วยให้คุณสามารถดึงข้อมูลเมตาที่ซ่อนอยู่ได้อย่างง่ายดาย ซึ่งช่วยลดความยุ่งยากในการเข้าถึงข้อมูลเมตาและการประมวลผลเอกสาร PDF, Microsoft Word, Excel และ PowerPoint ภายในแอปพลิเคชัน Node.js ของคุณ ควบคุมเนื้อหาของความคิดเห็น หน้าที่ซ่อน ฟิลด์แบบฟอร์ม คำอธิบายประกอบ ฯลฯ"
    }
  },
  "solutions": {
    "title": "GroupDocs.Metadata นำเสนอ API การประมวลผลข้อมูลสำหรับสภาพแวดล้อมการพัฒนายอดนิยมอื่นๆ"
  }
}