{
  "head": {
    "title": "API метаданных Java — просмотр, чтение, экспорт, редактирование, удаление метаданных документа",
    "description": "API метаданных Java для просмотра, чтения, редактирования, анализа, поиска, удаления, сравнения и экспорта метаданных документов PDF, Word, Excel, PPTX, Outlook, Visio, аудио, видео и изображений."
  },
  "header": {
    "title": "API управления метаданными для Java",
    "description": "Разрабатывайте приложения Java для создания, просмотра, доступа, обновления, удаления, поиска, сравнения, замены и экспорта метаданных популярных форматов документов и изображений."
  },
  "submenu": {
    "middle": {
      "overview": "Обзор",
      "features": "Функции",
      "support": "Поддерживать",
      "livedemo": "Живая демонстрация",
      "pricing": "Цены"
    }
  },
  "overview": {
    "content": {
      "paragraph_1": "GroupDocs.Metadata for Java — это расширенный API управления метаданными для управления метаданными документов, изображений, архивов, торрентов и различных других форматов файлов. Теперь разработчики могут расширять функциональные возможности своих Java-приложений, легко добавляя функции просмотра, изменения, удаления, извлечения, поиска, сравнения, замены и экспорта метаданных во всех популярных форматах деловых документов, таких как PDF, Microsoft Office Word, электронные таблицы Excel, презентации PowerPoint и т. д. слайды, электронные письма Outlook, Project, схемы Visio, OneNote, изображения, AutoCAD, Photoshop, аудио, видео, шрифты OpenType и метафайлы.",
      "paragraph_2": "Библиотека метаданных Java предлагает такие функции, как поиск метаданных, замену свойств метаданных, сравнение метаданных поддерживаемых форматов файлов для выявления сходств и различий. Вы также можете редактировать или изменять метаданные для лучшего управления информацией и экспортировать полученную информацию метаданных в файл Excel, файл CSV и DataSet. API предлагает всестороннюю поддержку для работы со всеми широко используемыми стандартами метаданных, такими как встроенные, XMP, EXIF ​​и пользовательские свойства метаданных в поддерживаемых форматах документов.",
      "paragraph_3": "GroupDocs.Metadata for Java совместим со всеми версиями Java и поддерживает популярные операционные системы (Windows, Linux, MacOS), способные запускать среду выполнения Java."
    }
  },
  "tabs": {
    "tab_one": {
      "description": "Ниже приводится обзор GroupDocs.Metadata для Java:",
      "left": {
        "title": "Работа с изображениями",
        "content": {
          "line_1": "Метаданные XMP",
          "line_2": "Метаданные EXIF",
          "line_3": "Метаданные IPTC-IIM",
          "line_4": "Метаданные PSD",
          "line_5": "Метаданные САПР",
          "line_6": "Анализ дополнительных тегов IFD"
        }
      },
      "right": {
        "title": "Работа с аудио и видео",
        "content": {
          "line_1": "Обнаружение формата MP3 во время выполнения",
          "line_2": "Читать тег Lyrics3",
          "line_3": "Чтение аудиоинформации MPEG",
          "line_4": "Чтение информации заголовка AVI",
          "line_5": "Читать субтитры Матроски",
          "line_6": "Экспорт данных в Excel или CSV"
        }
      }
    },
    "tab_two": {
      "description": "GroupDocs.Metadata для Java поддерживает следующие",
      "formats_url_title": "форматы файлов документов",
      "left": {
        "title": "Microsoft Office"
      },
      "right": {
        "title": "Другие форматы",
        "content": {
          "line_5": "Аудио",
          "line_6": "видео",
          "line_9": "Картинки",
          "line_11": "Шрифты OpenType",
          "line_12": "Другие"
        }
      }
    },
    "tab_three": {
      "description": "GroupDocs.Metadata для .NET поддерживает следующие операционные системы, платформы и менеджеры пакетов:",
      "left": {
        "title": "Операционные системы",
        "content": {
          "line_1": "Рабочий стол Windows",
          "line_2": "Windows-сервер",
          "line_3": "Windows Azure",
          "line_4": "линукс"
        },
        "title_2": "Поддерживаемые платформы",
        "content_2": {
          "line_1": ".NET Framework 2.0 или выше",
          "line_2": "Монофреймворк 1.2 или выше",
          "line_3": ".NET Стандарт 2.0",
          "line_4": ".NET Core 2.0",
          "line_5": ".NET Core 2.1"
        }
      },
      "right": {
        "title": "Менеджеры пакетов",
        "content": {
          "line_1": "* NuGet"
        },
        "title_2": "Среды разработки",
        "content_2": {
          "line_1": "*Майкрософт Визуальная студия",
          "line_2": "* Xamarin.Android",
          "line_3": "* Xamarin.IOS",
          "line_4": "* Xamarin.Mac",
          "line_5": "* МоноДевелопмент"
        }
      }
    }
  },
  "features": {
    "title": "GroupDocs.Metadata для функций Java",
    "feature_1": {
      "content": "Управление встроенными и пользовательскими метаданными и получение метаданных торрентов и форматов архивов"
    },
    "feature_2": {
      "content": "Доступ и удаление скрытых данных в Microsoft Word, Excel, PowerPoint и PDF"
    },
    "feature_3": {
      "content": "Определить тип файла документа во время выполнения"
    },
    "feature_4": {
      "content": "Идентификация/удаление цифровых подписей в Word, Excel, PDF"
    },
    "feature_5": {
      "content": "Обнаружение защиты паролем документов в Word, Excel, PowerPoint и PDF"
    },
    "feature_6": {
      "content": "Получение миниатюр и предварительный просмотр изображений поддерживаемых форматов и поддержка Matroska Multimedia Container"
    },
    "feature_7": {
      "content": "Извлечение текстовых метаданных из файлов изображений PNG"
    },
    "feature_8": {
      "content": "Поддерживает перечисление любого типа метаданных и чтение метаданных файлов шрифтов OpenType"
    },
    "feature_9": {
      "content": "Чтение свойства метаданных с использованием определенного ключа для любого поддерживаемого формата"
    },
    "feature_10": {
      "content": "Получить/удалить метаданные сообщений электронной почты и удалить вложения"
    },
    "feature_11": {
      "content": "Чтение субтитров Matroska и получение метаданных аудио- и видеофайлов"
    },
    "feature_12": {
      "content": "Создание превью изображений для файлов EPUB, CAD, EML и MSG"
    },
    "feature_13": {
      "content": "Определите различия или сходства в метаданных поддерживаемых форматов путем сравнения"
    },
    "feature_14": {
      "content": "Поиск свойств документа, метаданных EXIF ​​и XMP"
    },
    "feature_15": {
      "content": "Замена свойств метаданных Word, Excel, PowerPoint и PDF"
    },
    "feature_16": {
      "content": "Экспорт метаданных поддерживаемых форматов файлов в Excel, CSV или DataSet"
    },
    "feature_17": {
      "content": "Добавление или обновление свойств метаданных XMP и EXIF ​​произвольных типов с помощью API поиска"
    },
    "feature_18": {
      "content": "Управление свойствами метаданных изображения и удаление информации о местоположении фотографии"
    },
    "feature_19": {
      "content": "Удалить метаданные и комментарии из отчетов и документов"
    },
    "feature_20": {
      "content": "Извлечение метаданных из файлов Microsoft Excel, начиная с Excel 95"
    },
    "feature_21": {
      "content": "Сокращение потребления памяти форматами PDF, Excel и изображений"
    },
    "feature_22": {
      "content": "Обновление свойств метаданных EXIF ​​в файлах WEBP, PNG и PSD"
    },
    "feature_23": {
      "content": "Извлечение свойств метаданных XMP в файлы MOV, MP3 и WEBP"
    },
    "feature_24": {
      "content": "Добавление, обновление и удаление пакетов метаданных IPTC в изображениях TIFF"
    },
    "feature_25": {
      "content": "Добавление, обновление и удаление пакетов метаданных EXIF ​​в изображениях JPEG2000"
    },
    "feature_26": {
      "content": "Чтение тегов EXIF ​​и свойств метаданных XMP из форматов изображений HEIC/HEIF"
    },
    "feature_27": {
      "content": "Чтение метаданных из зашифрованных файлов Microsoft Project"
    }
  },
  "more_feature": {
    "feature_1": {
      "title": "Эффективно извлекать свойства метаданных",
      "content": "С помощью GroupDocs.Metadata for Java API свойства метаданных поддерживаемых форматов файлов могут быть извлечены довольно эффективно. Код для этого довольно прост и прямолинеен. Ниже приведен пример, показывающий, как легко получить свойства метаданных файла MP3 с помощью Java:"
    },
    "feature_2": {
      "title": "Получить скрытые данные для манипулирования",
      "content": "GroupDocs.Metadata for Java предоставляет комплексный способ получения и удаления скрытых данных из файлов Microsoft Word, Excel и PowerPoint. Вы также можете сделать то же самое для документов PDF. Вы можете управлять комментариями, полями слияния, скрытыми страницами, полями форм, аннотациями и многим другим."
    }
  },
  "solutions": {
    "title": "GroupDocs.Metadata предлагает API для просмотра документов для других популярных сред разработки."
  }
}