{
  "head": {
    "title": ".NET, Java API et applications de manipulation de métadonnées en ligne par GroupDocs",
    "description": "Documentez les API de métadonnées natives de C# .NET et Java. Lisez, écrivez, modifiez et comparez les méta-informations de tous les formats populaires. Analysez et exportez les métadonnées."
  },
  "header": {
    "title": "Solution de gestion des métadonnées de documents",
    "description": "API et applications pour lire, modifier, remplacer et supprimer les métadonnées des documents, images et autres formats de fichiers sur les plates-formes populaires."
  },
  "apis": {
    "highcode": {
      "title": "GroupDocs.Metadata High Code API incluses",
      "label": "Afficher toutes les High Code API",
      "net": {
        "content": "API native .NET pour lire, écrire, modifier et supprimer dynamiquement les méta-informations de Microsoft Office, PDF, multimédia, images et divers autres formats de fichiers."
      },
      "java": {
        "content": "Java API pour éditer et manipuler les métadonnées des documents, images, fichiers vidéo et divers autres formats de fichiers."
      },
      "nodejs-java": {
        "content": "Node.js via une solution Java pour contrôler et manipuler différents types de métadonnées dans des formats de fichiers courants tels que des PDF, des documents Office ou des images."
      }
    },
    "lowcode": {
      "title": "GroupDocs.Metadata Low Code API incluses",
      "label": "Afficher toutes les Low Code API",
      "curl": {
        "content": "Travaillez avec les API de manipulation de métadonnées complètes cURL REST pour gérer les informations de métadonnées de PDF, Word, Excel, les présentations, les images et les fichiers multimédias dans vos applications."
      },
      "net": {
        "content": "Utilisez l'API REST de métadonnées avec le SDK .NET pour ajouter, modifier, extraire, rechercher et supprimer les métadonnées des formats de document dans les applications .NET."
      },
      "java": {
        "content": "Améliorez vos applications Java avec de puissantes fonctionnalités de gestion des métadonnées à l'aide de Metadata SDK for Java."
      }
    },
    "nocode": {
      "title": "GroupDocs.Metadata No Code Applications incluses",
      "label": "Afficher toutes les No Code applications",
      "total": {
        "content": "Application gratuite pour afficher et modifier les métadonnées de Word, Excel, PDF, PowerPoint et plus de 50 types de documents."
      },
      "docx": {
        "content": "Visualiseur et éditeur de métadonnées en ligne gratuits pour MS Word documents."
      },
      "pdf": {
        "content": "Affichez ou modifiez les informations de métadonnées de PDF documents en ligne."
      }
    }
  }
}