{
  "head": {
    "title": ".NET, Java API и онлайн-приложения для обработки метаданных от GroupDocs",
    "description": "API метаданных документов, встроенные в C# .NET и Java. Читайте, записывайте, редактируйте и сравнивайте метаинформацию всех популярных форматов. Анализируйте и экспортируйте метаданные."
  },
  "header": {
    "title": "Решение для управления метаданными документов",
    "description": "API и приложения для чтения, редактирования, замены и удаления метаданных документов, изображений и других форматов файлов на популярных платформах."
  },
  "apis": {
    "highcode": {
      "title": "GroupDocs.Metadata High Code API включают",
      "label": "Просмотреть все High Code API",
      "net": {
        "content": "Встроенный API .NET для динамического чтения, записи, редактирования и удаления метаинформации из Microsoft Office, PDF, мультимедиа, изображений и других форматов файлов."
      },
      "java": {
        "content": "Java API для редактирования и обработки метаданных документов, изображений, видеофайлов и различных других форматов файлов."
      },
      "nodejs-java": {
        "content": "Решение Node.js-Java для управления и манипулирования различными типами метаданных в популярных форматах файлов, таких как PDF, документы Office или изображения."
      }
    },
    "lowcode": {
      "title": "GroupDocs.Metadata Low Code API включают",
      "label": "Просмотреть все Low Code API",
      "curl": {
        "content": "Работайте с полными API-интерфейсами управления метаданными cURL REST для управления метаданными PDF, Word, Excel, презентаций, изображений и мультимедийных файлов в ваших приложениях."
      },
      "net": {
        "content": "Используйте API метаданных REST вместе с .NET SDK для добавления, редактирования, извлечения, поиска и удаления метаданных из форматов документов в приложениях .NET."
      },
      "java": {
        "content": "Расширьте возможности приложений Java с помощью мощных функций управления метаданными с помощью Metadata SDK for Java."
      }
    },
    "nocode": {
      "title": "GroupDocs.Metadata No Code Приложения включают",
      "label": "Просмотреть все приложения No Code",
      "total": {
        "content": "Бесплатное приложение для просмотра и редактирования метаданных Word, Excel, PDF, PowerPoint и более 50 типов документов."
      },
      "docx": {
        "content": "Бесплатный онлайн-просмотрщик и редактор метаданных для документов MS Word."
      },
      "pdf": {
        "content": "Просматривайте или редактируйте метаданные документов PDF онлайн."
      }
    }
  }
}