{
  "head": {
    "title": "อ่านและแยกข้อมูลเมตาของไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{EnvName}}",
    "description": "API การจัดการข้อมูลเมตาข้ามแพลตฟอร์ม {{EnvName}} เพื่ออ่านและแยกข้อมูลเมตาดาต้าของไฟล์ {{FileFormatUp}} ทำงานร่วมกับมาตรฐานข้อมูลเมตา XMP, EXIF, IPTC, ID3 ฯลฯ"
  },
  "header": {
    "title": "แยกข้อมูลเมตาจากไฟล์ {{FileFormatUp}} ใน {{EnvName}}",
    "description": "อ่านและแยกข้อมูลเมตาดาต้าจากเอกสาร รูปภาพ เสียง และวิดีโอรูปแบบต่างๆ โดยใช้ {{ProdFullName}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API ของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) นำเสนอชุดคุณสมบัติการจัดการและจัดการข้อมูลเมตาขั้นสูง ช่วยให้นักพัฒนาสามารถอ่าน แก้ไข ลบ ค้นหา เปรียบเทียบ แทนที่ และส่งออกข้อมูลเมตาดาต้าจากรูปภาพและรูปแบบเอกสารได้อย่างง่ายดายโดยไม่ต้อง โดยใช้ซอฟต์แวร์ภายนอกใดๆ แยกรายละเอียดเมตาดาต้าจากรูปแบบไฟล์ PDF, Word, Excel, PowerPoint, Outlook, OneNote, Visio, Project, AutoCAD, Archive และมัลติมีเดีย และดำเนินการเมตาดาต้าที่รองรับด้วยความยืดหยุ่นอย่างแท้จริง"
  },
  "formats": {
    "title": "การอ่านและแตกไฟล์รูปแบบอื่น",
    "description": "API การแยกข้อมูลเมตาของเอกสารและรูปภาพหลายรูปแบบสำหรับ {{EnvName}} ดึงข้อมูลเมตาของรูปแบบไฟล์ยอดนิยมบางรูปแบบตามที่ระบุไว้ด้านล่าง"
  },
  "examples": {
    "comment_1": "ค้นหาข้อมูลเมตาของรูปภาพในเอกสาร {{FileFormatUp}}",
    "comment_2": "เขียน {{TextMetadata}} ผ่าน {{FileFormatUp}} ไปยัง Constructor",
    "comment_3": "ดึงคุณสมบัติข้อมูลเมตาทั้งหมดที่อยู่ในหมวดหมู่เฉพาะ",
    "comment_4": "ประมวลผลรายการข้อมูลเมตาที่พบ"
  },
  "steps": {
    "title": "ขั้นตอนสำหรับการแยกข้อมูลเมตา {{FileFormatUp}} ใน {{EnvName}}",
    "content": {
      "title": "[{{ProdShortName}}]({{ProductUrl}}) ทำให้นักพัฒนา {{EnvName}} สามารถแยกเพื่ออ่านและแยกข้อมูลเมตาจากไฟล์ {{FileFormatUp}} จากภายในแอปพลิเคชันของตนได้อย่างง่ายดายโดยทำตามขั้นตอนง่ายๆ เพียงไม่กี่ขั้นตอน",
      "step_1": "โหลด {{FileFormatUp}} ด้วยอินสแตนซ์ของคลาส {{EnvName}}",
      "step_2": "สร้างภาคแสดงเพื่อตรวจสอบคุณสมบัติข้อมูลเมตาทั้งหมด",
      "step_3": "ส่งภาคแสดงไปยังเมธอด {{TextFindProperties}}",
      "step_4": "วนซ้ำคุณสมบัติที่พบ"
    }
  },
  "more_features": {
    "title": "ค้นหาข้อมูลเมตาในไฟล์ธุรกิจด้วย {{ProdShortName}}",
    "description": "ควบคุมข้อมูลที่ซ่อนอยู่ในไฟล์และเอกสารที่ละเอียดอ่อนโดยใช้แอปพลิเคชัน {{EnvName}} ที่ขับเคลื่อนโดยไลบรารี {{ProdShortName}}",
    "image_description": "{{EnvName}} ค้นหาข้อมูลเมตา",
    "feature_1": {
      "title": "เครื่องมือ {{EnvName}} สำหรับการค้นหาข้อมูลเมตาโดยละเอียด",
      "content": "ปรับปรุงความสามารถในการประมวลผลเอกสารของคุณใน {{EnvName}} ด้วย {{ProdShortName}} ซอฟต์แวร์ของเรามีเครื่องมือที่มีประสิทธิภาพในการค้นหาและประมวลผลเมตาดาต้าที่ซ่อนอยู่"
    },
    "feature_2": {
      "title": "การปรับแต่งการดึงข้อมูลเมตา",
      "content": "กำหนดเป้าหมายข้อมูลเมตาที่เฉพาะเจาะจงได้อย่างแม่นยำ กำหนดค่าการค้นหาของคุณให้กรองตามพารามิเตอร์ต่างๆ เช่น ข้อความ วันที่ นิพจน์ทั่วไป ฯลฯ เพื่อให้มั่นใจว่าคุณจะได้รับสิ่งที่คุณต้องการอย่างแน่นอน"
    },
    "feature_3": {
      "title": "การประมวลผลข้อมูลเมตาที่มีประสิทธิภาพ",
      "content": "ใช้ประโยชน์จาก {{EnvName}} เพื่อประมวลผลค่าของรายการข้อมูลเมตาที่พบ ใช้ {{ProdShortName}} เพื่อจัดการข้อมูลเมตาอย่างมีประสิทธิภาพ คุณสามารถเพิ่ม อัปเดต หรือล้างข้อมูลเมตาในรูปแบบที่รองรับได้อย่างอิสระ"
    },
    "code_1": {
      "title": "{{EnvName}} ตัวอย่าง: ข้อมูลเมตาของหนังสืออิเล็กทรอนิกส์",
      "content": "ตัวอย่างโค้ดนี้แสดงวิธีการอ่านคุณสมบัติเมตาดาต้าเฉพาะรูปแบบ EPUB",
      "comment_1": "ส่งหนังสืออิเล็กทรอนิกส์ EPUB ไปยังออบเจ็กต์ {{TextMetadata}}",
      "comment_2": "รับข้อมูลเมตาในตัวทั้งหมด",
      "comment_3": "ประมวลผลข้อมูลที่ดึงมา"
    }
  }
}