{
  "head": {
    "title": "อ่านข้อมูลเมตาจากไฟล์ {{FileFormatUp}} ในแอป {{EnvNameShort}}",
    "description": "เข้าถึงและแยกข้อมูลเมตาจากไฟล์ {{FileFormatUp}} จาก {{EnvNameShort}} ได้อย่างง่ายดาย ใช้งานได้กับรูปแบบทั่วไป เช่น XMP, EXIF, IPTC, ID3"
  },
  "header": {
    "title": "แยกข้อมูลเมตาจากไฟล์ {{FileFormatUp}}",
    "description": "แยกข้อมูลเมตาจากเอกสาร รูปภาพ รูปแบบเสียงและวิดีโอที่หลากหลายโดยใช้ {{ProdFullName}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "{{ProdFullName}} API คืออะไร",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ช่วยให้คุณดู แก้ไข เพิ่ม ลบ ค้นหา และจัดการข้อมูลเมตาจากรูปภาพและเอกสารได้อย่างง่ายดาย ไม่จำเป็นต้องใช้ซอฟต์แวร์ภายนอก! แยกรายละเอียดจากรูปแบบต่างๆ เช่น PDF, เอกสาร Word, แผ่นงาน Excel และอื่นๆ นอกจากนี้ยังมีฟีเจอร์ขั้นสูงสำหรับการทำงานกับเมทาดาทาอีกด้วย"
  },
  "formats": {
    "title": "อ่านรายละเอียดจากไฟล์ประเภทอื่น",
    "description": "แยกข้อมูลเมตาจากเอกสารและรูปภาพต่างๆ ใน ​​{{EnvName}} API นี้รองรับรูปแบบยอดนิยมเช่น..."
  },
  "examples": {
    "comment_1": "แยกรายละเอียดทั้งหมดจากไฟล์ {{FileFormatUp}}",
    "comment_2": "เขียน {{TextMetadata}} ผ่าน {{FileFormatUp}} ไปยัง Constructor",
    "comment_3": "แยกรายละเอียดทั้งหมดออกจากไฟล์",
    "comment_4": "ใช้ข้อมูลเมตาที่แยกออกมาสำหรับแอปพลิเคชันของคุณ"
  },
  "steps": {
    "title": "วิธีแยกข้อมูลเมตาจากไฟล์ {{FileFormatUp}} ใน {{EnvNameShort}} ด้วย {{ProdShortName}}",
    "content": {
      "title": "แยกข้อมูลเมตาจากไฟล์ {{FileFormatUp}} ภายในแอปพลิเคชัน {{EnvName}} ของคุณได้อย่างง่ายดายโดยใช้ [{{ProdShortName}}]({{ProductUrl}}) มีวิธีดังนี้:",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} ที่คุณต้องการแยกข้อมูลเมตา",
      "step_2": "ใช้ตัวกรองเพื่อระบุรายละเอียดที่คุณต้องการแยก",
      "step_3": "เริ่มกระบวนการแยกข้อมูลโดยใช้ {{TextFindProperties}}",
      "step_4": "เข้าถึงรายละเอียดที่แยกออกมาตามความต้องการของแอปพลิเคชันของคุณ"
    }
  },
  "more_features": {
    "title": "ค้นหาข้อมูลเมตาที่ซ่อนอยู่ในไฟล์ธุรกิจด้วย {{ProdShortName}}",
    "description": "ค้นหาและจัดการรายละเอียดที่ซ่อนอยู่ (ข้อมูลเมตา) ในเอกสารละเอียดอ่อนได้อย่างง่ายดายด้วยแอปพลิเคชัน {{EnvName}} โดยใช้ไลบรารี {{ProdShortName}}",
    "image_description": "ค้นหาข้อมูลเมตาในไฟล์ {{EnvNameShort}}",
    "feature_1": {
      "title": "การค้นหาข้อมูลเมตาที่มีประสิทธิภาพสำหรับ {{EnvNameShort}}",
      "content": "เพิ่มประสิทธิภาพการประมวลผลเอกสารของคุณใน {{EnvName}} ด้วย {{ProdShortName}} ค้นหารายละเอียดที่ซ่อนอยู่อย่างรวดเร็วและง่ายดายโดยใช้เครื่องมือค้นหาของเรา"
    },
    "feature_2": {
      "title": "การกรองข้อมูลเมตาที่แม่นยำ",
      "content": "กำหนดเป้าหมายข้อมูลเฉพาะที่คุณต้องการ ค้นหาด้วยข้อความ วันที่ หรือใช้รูปแบบพิเศษเพื่อค้นหาสิ่งที่คุณกำลังมองหา"
    },
    "feature_3": {
      "title": "การจัดการข้อมูลเมตาที่มีประสิทธิภาพ",
      "content": "ใช้ {{ProdShortName}} เพื่อจัดการรายละเอียด (ข้อมูลเมตา) ที่คุณพบในไฟล์ {{EnvName}} เพิ่ม อัปเดต หรือลบรายละเอียดตามต้องการ ทั้งหมดนี้อยู่ในรูปแบบไฟล์ที่รองรับ"
    },
    "code_1": {
      "title": "อ่านรายละเอียด E-Book (ตัวอย่าง {{EnvName}})",
      "content": "ตัวอย่างโค้ดนี้แสดงวิธีเข้าถึงรายละเอียดเฉพาะของ eBook ของ EPUB",
      "comment_1": "โหลดไฟล์ EPUB ลงในออบเจ็กต์ {{TextMetadata}}",
      "comment_2": "ดึงรายละเอียดในตัวทั้งหมดจากไฟล์ EPUB",
      "comment_3": "ใช้ข้อมูลที่ดึงมาตามความต้องการของแอปพลิเคชันของคุณ"
    }
  }
}