{
  "head": {
    "title": "อ่านและแยกข้อมูลเมตาของไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}}",
    "description": "API การจัดการข้อมูลเมตาข้ามแพลตฟอร์ม {{ProgLang}} เพื่ออ่านและแยกข้อมูลเมตาดาต้าของไฟล์ {{FileFormatUp}} ทำงานร่วมกับมาตรฐานข้อมูลเมตา XMP, EXIF, IPTC, ID3 ฯลฯ"
  },
  "header": {
    "title": "แยกข้อมูลเมตาจากไฟล์ {{FileFormatUp}} ใน {{ProgLang}}",
    "description": "อ่านและแยกข้อมูลเมตาดาต้าจากเอกสาร รูปภาพ รูปแบบเสียงและวิดีโอที่หลากหลายโดยใช้ GroupDocs.Metadata สำหรับ {{EnvName}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdFullName}} API",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) นำเสนอชุดคุณสมบัติการจัดการและจัดการข้อมูลเมตาขั้นสูง ช่วยให้นักพัฒนาสามารถอ่าน แก้ไข ลบ ค้นหา เปรียบเทียบ แทนที่ และส่งออกข้อมูลเมตาดาต้าจากรูปภาพและรูปแบบเอกสารได้อย่างง่ายดายโดยไม่ต้อง โดยใช้ซอฟต์แวร์ภายนอกใดๆ แยกรายละเอียดเมตาดาต้าจากรูปแบบไฟล์ PDF, Word, Excel, PowerPoint, Outlook, OneNote, Visio, Project, AutoCAD, Archive และมัลติมีเดีย และดำเนินการเมตาดาต้าที่รองรับด้วยความยืดหยุ่นอย่างแท้จริง"
  },
  "formats": {
    "title": "การอัปเดตคุณสมบัติข้อมูลเมตาจากรูปแบบไฟล์อื่น",
    "description": "API การแก้ไขข้อมูลเมตาของเอกสารและรูปภาพหลายรูปแบบสำหรับ {{EnvName}} ดึงข้อมูลเมตาของรูปแบบไฟล์ยอดนิยมบางรูปแบบตามที่ระบุไว้ด้านล่าง"
  },
  "examples": {
    "comment_1": "แยกคุณสมบัติข้อมูลเมตา {{FileFormatUp}} ตามเกณฑ์ต่างๆ",
    "comment_2": "สร้าง {{TextMetadata}} ผ่านเส้นทาง {{FileFormatUp}}",
    "comment_3": "แยกคุณสมบัติข้อมูลเมตาทั้งหมดที่อยู่ในหมวดหมู่เฉพาะ",
    "comment_4": "วนซ้ำคุณสมบัติและการแสดงผลทั้งหมด",
    "comment_5": "แยกคุณสมบัติทั้งหมดที่มีประเภทและค่าเฉพาะ",
    "comment_6": "แสดงคุณสมบัติวันที่และเวลาทั้งหมดโดยมีค่าปีเท่ากับปีปัจจุบัน",
    "comment_7": "แยกคุณสมบัติทั้งหมดที่มีชื่อตรงกับ regex ที่ระบุ",
    "comment_8": "แสดงคุณสมบัติที่มีชื่อตรงกับรูปแบบต่อไปนี้"
  },
  "steps": {
    "title": "ขั้นตอนสำหรับการแยกข้อมูลเมตา {{FileFormatUp}} ใน {{EnvName}}",
    "content": {
      "title": "[{{ProdShortName}}]({{ProductUrl}}) ทำให้นักพัฒนา {{EnvName}} สามารถแยกเพื่ออ่านและแยกข้อมูลเมตาจากไฟล์ {{FileFormatUp}} จากภายในแอปพลิเคชันของตนได้อย่างง่ายดายโดยทำตามขั้นตอนง่ายๆ เพียงไม่กี่ขั้นตอน",
      "step_1": "โหลด {{FileFormatUp}} ด้วยอินสแตนซ์ของคลาส {{EnvName}}",
      "step_2": "สร้างภาคแสดงเพื่อตรวจสอบคุณสมบัติข้อมูลเมตาทั้งหมด",
      "step_3": "ส่งภาคแสดงไปยังเมธอด {{TextFindProperties}}",
      "step_4": "วนซ้ำคุณสมบัติที่พบ"
    }
  },
  "more_features": {
    "title": "ค้นหาข้อมูลเมตาของไฟล์ด้วย {{ProdShortName}}",
    "description": "จัดการข้อมูลเมตาที่ซ่อนอยู่ภายในเอกสารละเอียดอ่อนอย่างปลอดภัยโดยใช้แอปพลิเคชัน {{EnvName}} ที่ขับเคลื่อนโดยไลบรารี {{ProdShortName}}",
    "image_description": "ค้นหาข้อมูลเมตาในไฟล์ {{EnvName}}",
    "feature_1": {
      "title": "เครื่องมือ {{EnvName}} สำหรับการค้นหาข้อมูลเมตาที่ครอบคลุม",
      "content": "ปรับปรุงการประมวลผลเอกสารของคุณใน {{EnvName}} ด้วย {{ProdShortName}} ซอฟต์แวร์ของเรานำเสนอเครื่องมืออันทรงพลังเพื่อค้นหาและจัดการเมตาดาต้าที่ซ่อนอยู่อย่างมีประสิทธิภาพ"
    },
    "feature_2": {
      "title": "การกำหนดเป้าหมายข้อมูลเมตาที่แม่นยำ",
      "content": "กำหนดเป้าหมายข้อมูลเมตาที่เฉพาะเจาะจงด้วยความแม่นยำที่ระบุ กำหนดค่าการค้นหาของคุณด้วยตัวกรองต่างๆ เช่น ข้อความ วันที่ หรือนิพจน์ทั่วไป เพื่อค้นหาข้อมูลเมตาที่คุณต้องการ"
    },
    "feature_3": {
      "title": "การจัดการข้อมูลเมตาที่ง่ายดาย",
      "content": "ใช้ประโยชน์จาก {{EnvName}} เพื่อประมวลผลค่าของรายการข้อมูลเมตาที่ค้นพบ {{ProdShortName}} ช่วยให้คุณสามารถเพิ่ม อัปเดต หรือลบข้อมูลเมตาได้อย่างมีประสิทธิภาพภายในรูปแบบไฟล์ที่รองรับ"
    },
    "code_1": {
      "title": "อ่านข้อมูลเมตาของ E-Book ใน {{ProgLang}}",
      "content": "ตัวอย่างโค้ดนี้สาธิตวิธีเข้าถึงคุณสมบัติข้อมูลเมตาเฉพาะสำหรับ eBook ของ EPUB",
      "comment_1": "โหลดไฟล์ EPUB ลงในออบเจ็กต์ {{TextMetadata}}",
      "comment_2": "ดึงข้อมูลเมตาในตัวทั้งหมด",
      "comment_3": "ใช้ข้อมูลที่ดึงมาตามความต้องการของแอปพลิเคชันของคุณ"
    }
  }
}