{
  "head": {
    "title": "Leer y extraer metadatos de archivos {{FileFormatUp}} en aplicaciones {{EnvName}}",
    "description": "API de administración de metadatos {{EnvName}} multiplataforma para leer y extraer información de metadatos de archivos {{FileFormatUp}}. Trabaje con estándares de metadatos XMP, EXIF, IPTC, ID3, etc."
  },
  "header": {
    "title": "Extraiga metadatos del archivo {{FileFormatUp}} en {{EnvName}}",
    "description": "Lea y extraiga información de metadatos de una amplia gama de documentos, imágenes, formatos de audio y video usando {{ProdFullName}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Descargue prueba gratis"
  },
  "about": {
    "title": "Acerca de la API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ofrece un conjunto avanzado de funciones de manipulación y administración de metadatos, lo que permite a los desarrolladores leer, editar, eliminar, buscar, comparar, reemplazar y exportar fácilmente información de metadatos de imágenes y formatos de documentos sin utilizando cualquier software externo. Extraiga detalles de metadatos de formatos de archivos PDF, Word, Excel, PowerPoint, Outlook, OneNote, Visio, Project, AutoCAD, Archive y Multimedia, y realice operaciones de metadatos compatibles con verdadera flexibilidad."
  },
  "formats": {
    "title": "Leer y extraer otros formatos de archivos",
    "description": "API de extracción de metadatos de imágenes y documentos multiformato para {{EnvName}}. Recupere metadatos de algunos de los formatos de archivo populares como se indica a continuación."
  },
  "examples": {
    "comment_1": "Buscar metadatos de imagen en el documento {{FileFormatUp}}",
    "comment_2": "Redacte {{TextMetadata}} pasando {{FileFormatUp}} al constructor",
    "comment_3": "Obtenga todas las propiedades de metadatos que pertenecen a una categoría particular",
    "comment_4": "Procesar entradas de metadatos encontradas"
  },
  "steps": {
    "title": "Pasos para la extracción de metadatos de {{FileFormatUp}} en {{EnvName}}",
    "content": {
      "title": "[{{ProdShortName}}]({{ProductUrl}}) facilita a los desarrolladores de {{EnvName}} extraer, leer y extraer información de metadatos de archivos {{FileFormatUp}} desde sus aplicaciones mediante la implementación de unos sencillos pasos.",
      "step_1": "Cargue {{FileFormatUp}} con una instancia de la clase {{EnvName}}.",
      "step_2": "Cree un predicado para examinar todas las propiedades de los metadatos.",
      "step_3": "Pase el predicado al método {{TextFindProperties}}.",
      "step_4": "Iterar a través de las propiedades encontradas."
    }
  },
  "more_features": {
    "title": "Búsqueda de metadatos en archivos comerciales con {{ProdShortName}}",
    "description": "Controle los datos ocultos en archivos y documentos confidenciales utilizando aplicaciones {{EnvName}} impulsadas por la biblioteca {{ProdShortName}}.",
    "image_description": "{{EnvName}} Búsqueda de metadatos",
    "feature_1": {
      "title": "{{EnvName}} Herramientas para búsqueda detallada de metadatos",
      "content": "Mejore sus capacidades de procesamiento de documentos en {{EnvName}} con {{ProdShortName}}. Nuestro software proporciona herramientas efectivas para buscar y procesar metadatos ocultos."
    },
    "feature_2": {
      "title": "Personalización de recuperación de metadatos",
      "content": "Apunte a metadatos específicos con precisión. Configure su búsqueda para filtrar por muchos parámetros como texto, fecha, expresiones regulares, etc., asegurándose de obtener exactamente lo que necesita."
    },
    "feature_3": {
      "title": "Procesamiento eficiente de metadatos",
      "content": "Aproveche {{EnvName}} para procesar valores de entradas de metadatos encontradas. Utilice {{ProdShortName}} para manipular metadatos de forma eficaz. Eres libre de agregar, actualizar o borrar cualquier metadato en los formatos compatibles."
    },
    "code_1": {
      "title": "{{EnvName}} Ejemplo: Metadatos de libros electrónicos",
      "content": "Este ejemplo de código muestra cómo leer propiedades de metadatos específicas del formato EPUB.",
      "comment_1": "Pasar libro electrónico EPUB al objeto {{TextMetadata}}",
      "comment_2": "Obtenga todos los metadatos integrados",
      "comment_3": "Procesar datos recuperados"
    }
  }
}