{
  "head": {
    "title": "Remova metadados de arquivos {{FileFormatUp}} em aplicativos {{ProgLang}}",
    "description": "API de processamento de metadados {{ProgLang}} para remover informações de metadados de arquivos {{FileFormatUp}}. Trabalhe com padrões de metadados XMP, EXIF, IPTC, ID3 etc."
  },
  "header": {
    "title": "Remover metadados do arquivo {{FileFormatUp}} em {{ProgLang}}",
    "description": "Remova informações de metadados de vários formatos de documentos, imagens, arquivos de áudio e vídeo usando a API {{ProdFullName}}",
    "subtitle": "API {{ProdFullName}}",
    "action_title": "Baixe a avaliação gratuita"
  },
  "about": {
    "title": "Sobre a API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) oferece um conjunto avançado de recursos de manipulação de metadados, permitindo que os desenvolvedores leiam, editem, removam, pesquisem, comparem, substituam e exportem facilmente informações de metadados de imagens e formatos de documentos sem usar qualquer software externo. Use a API de gerenciamento de metadados para excluir detalhes de metadados de formatos de arquivo PDF, Microsoft Office Word, planilhas Excel, apresentações PowerPoint, Outlook, OneNote, Visio, Project, AutoCAD, Archive e Multimídia, juntamente com muitos outros recursos de processamento de metadados."
  },
  "formats": {
    "title": "Excluindo propriedades de metadados de outros formatos de arquivo",
    "description": "API de exclusão de metadados de documentos e imagens multiformato para {{EnvName}}. Recupere metadados de alguns dos formatos de arquivo populares conforme indicado abaixo."
  },
  "examples": {
    "comment_1": "Remover metadados do arquivo {{FileFormatUp}}",
    "comment_2": "Remova todas as menções de qualquer pessoa que contribuiu na criação do arquivo",
    "comment_3": "Remova todas as propriedades com o nome especificado",
    "comment_4": "Salvar resultado"
  },
  "steps": {
    "title": "Etapas para remover metadados {{FileFormatUp}} em {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{ProductUrl}}) torna mais fácil para os desenvolvedores de {{EnvName}} remover detalhes de metadados de arquivos {{FileFormatUp}} de dentro de seus aplicativos, implementando algumas etapas fáceis.",
      "step_1": "Carregue {{FileFormatUp}} com uma instância da classe {{TextMetadata}}.",
      "step_2": "Use um predicado para localizar as propriedades de metadados desejadas.",
      "step_3": "Use o método {{TextMetadataRemoveProperties}} para remover as propriedades.",
      "step_4": "Salve as alterações no formato {{FileFormatUp}}."
    }
  },
  "more_features": {
    "title": "Gerencie metadados de documentos facilmente",
    "description": "Mantenha seus arquivos organizados e pesquisáveis ​​com nosso gerenciamento de metadados de documentos fácil de usar. Acesse, edite e atualize vários detalhes para encontrar rapidamente o que você precisa.",
    "image_description": "Gerenciamento fácil de metadados de documentos",
    "feature_1": {
      "title": "Veja os metadados do documento rapidamente",
      "content": "Obtenha instantaneamente todas as informações importantes sobre um documento, como autor, data de criação e muito mais."
    },
    "feature_2": {
      "title": "Edite metadados de documentos facilmente",
      "content": "Atualize metadados diretamente em seus documentos para melhor organização, capacidade de pesquisa e precisão."
    },
    "feature_3": {
      "title": "Gerenciamento poderoso de metadados de documentos",
      "content": "Faça mais com os metadados do seu documento! Adicione informações personalizadas, remova dados desnecessários e garanta que tudo permaneça consistente."
    },
    "code_1": {
      "title": "Limpar metadados do arquivo ZIP",
      "content": "O trecho de código a seguir mostra como remover o comentário do usuário de um arquivo ZIP",
      "comment_1": "Carregar arquivo para processamento posterior",
      "comment_2": "Obtenha o pacote principal de metadados",
      "comment_3": "Remover comentários arquivados",
      "comment_4": "Salvar arquivo limpo"
    }
  }
}