{
  "head": {
    "title": "ลบข้อมูลเมตาออกจากไฟล์ {{FileFormatUp}} ใน {{EnvName}}",
    "description": "API ข้อมูลเมตา {{EnvName}} ข้ามแพลตฟอร์มเพื่อซ่อนและลบช่องข้อมูลเมตาออกจากไฟล์ {{FileFormatUp}} รองรับ XMP, EXIF, IPTC, ID3 และอื่นๆ"
  },
  "header": {
    "title": "ลบข้อมูลเมตา {{FileFormatUp}} ใน {{EnvName}}",
    "description": "ลบคุณสมบัติข้อมูลเมตาออกจาก {{FileFormatUp}} และรูปแบบไฟล์เอกสาร รูปภาพ และมัลติมีเดียยอดนิยมอื่นๆ โดยใช้ API {{ProdFullName}}",
    "subtitle": "{{ProdFullName}} API",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API ของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันขั้นสูงสำหรับการจัดการช่องข้อมูลเมตา อ่าน เพิ่ม อัปเดต ลบ ค้นหา เปรียบเทียบ แลกเปลี่ยน และส่งออกข้อมูลเมตาจากรูปภาพและเอกสารได้อย่างง่ายดายโดยไม่ต้องใช้ซอฟต์แวร์ภายนอก ลบข้อมูลเมตาออกจากไฟล์ Word, Excel, PowerPoint, Outlook, OneNote, Visio, Project, PDF, AutoCAD, ZIP, เสียงและวิดีโอ พร้อมด้วยคุณสมบัติอื่น ๆ อีกมากมาย"
  },
  "formats": {
    "title": "การลบข้อมูลเมตาออกจากรูปแบบไฟล์อื่น",
    "description": "API การลบข้อมูลเมตาของเอกสารและรูปภาพหลายรูปแบบสำหรับ {{EnvName}} ดึงข้อมูลและลบข้อมูลเมตาออกจากรูปแบบไฟล์ยอดนิยม"
  },
  "examples": {
    "comment_1": "ล้างข้อมูลเมตาของเอกสาร {{FileFormatUp}}",
    "comment_2": "ลบการกล่าวถึงผู้ร่วมให้ข้อมูลทั้งหมด",
    "comment_3": "ลบคุณสมบัติแบบกำหนดเองตามชื่อ",
    "comment_4": "บันทึกไฟล์ที่ล้างแล้ว"
  },
  "steps": {
    "title": "ขั้นตอนในการลบข้อมูลเมตาออกจาก {{FileFormatUp}} ใน {{EnvName}}",
    "content": {
      "title": "[{{ProdShortName}}]({{ProductUrl}}) ทำให้นักพัฒนา {{EnvName}} ลบข้อมูลเมตาออกจากไฟล์ {{FileFormatUp}} ได้อย่างง่ายดายด้วยขั้นตอนง่ายๆ เพียงไม่กี่ขั้นตอน",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} ที่จะอัปเดต",
      "step_2": "ส่งผ่านเพรดิเคตการค้นหาไปยังเมธอด {{TextRemoveProperties}}",
      "step_3": "ตรวจสอบจำนวนคุณสมบัติที่ถูกลบออก",
      "step_4": "บันทึกการเปลี่ยนแปลง"
    }
  },
  "more_features": {
    "title": "จัดการข้อมูลเมตาของเอกสารได้อย่างง่ายดาย",
    "description": "โซลูชันของเราทำให้การจัดการเมตาดาต้าง่ายขึ้น เข้าถึง แก้ไข และอัปเดตคุณสมบัติเอกสารได้อย่างง่ายดายเพื่อให้ไฟล์จัดระเบียบและค้นหาได้",
    "image_description": "ปกป้องข้อมูลเมตาของเอกสาร",
    "feature_1": {
      "title": "การควบคุมข้อมูลเมตาที่ง่ายดาย",
      "content": "ดึงข้อมูลและประมวลผลข้อมูลเมตาของเอกสารได้อย่างรวดเร็ว รับข้อมูลเชิงลึกเกี่ยวกับคุณสมบัติ เช่น ผู้เขียน วันที่สร้าง และอื่นๆ"
    },
    "feature_2": {
      "title": "การแก้ไขข้อมูลเมตาอย่างง่าย",
      "content": "แก้ไขข้อมูลเมตาของเอกสารโดยตรง อัปเดตคุณสมบัติเพื่อการจัดระเบียบที่ดีขึ้น ความสามารถในการค้นหา และความแม่นยำ"
    },
    "feature_3": {
      "title": "การจัดการข้อมูลเมตาที่มีประสิทธิภาพ",
      "content": "ดำเนินการขั้นสูงกับข้อมูลเมตาของเอกสาร เพิ่มคุณสมบัติที่กำหนดเองได้อย่างง่ายดาย ลบข้อมูลที่ไม่จำเป็น และรับประกันความสอดคล้อง"
    },
    "code_1": {
      "title": "ล้างข้อมูลเมตาที่เก็บถาวร ZIP",
      "content": "ข้อมูลโค้ดนี้แสดงวิธีลบความคิดเห็นของผู้ใช้ออกจากไฟล์ ZIP",
      "comment_1": "โหลดไฟล์เก็บถาวรเพื่อการประมวลผล",
      "comment_2": "รับแพ็คเกจข้อมูลเมตาหลัก",
      "comment_3": "ลบความคิดเห็นที่เก็บถาวร",
      "comment_4": "บันทึกไฟล์ที่ล้างแล้ว"
    }
  }
}