{
  "head": {
    "title": "ลบคุณสมบัติข้อมูลเมตาของไฟล์ {{FileFormatUp}} ใน {{EnvName}}",
    "description": "API ข้อมูลเมตาข้ามแพลตฟอร์ม {{EnvName}} เพื่อซ่อนและลบช่องข้อมูลเมตาของไฟล์ {{FileFormatUp}} ทำงานร่วมกับมาตรฐานข้อมูลเมตา XMP, EXIF, IPTC, ID3 ฯลฯ"
  },
  "header": {
    "title": "ลบข้อมูลเมตา {{FileFormatUp}} ใน {{EnvName}}",
    "description": "ลบคุณสมบัติข้อมูลเมตาออกจาก {{FileFormatUp}} และเอกสาร รูปภาพ และรูปแบบไฟล์มัลติมีเดียยอดนิยมอื่นๆ อีกมากมายโดยใช้ API {{ProdFullName}}",
    "subtitle": "{{ProdFullName}} API",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API ของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันการจัดการฟิลด์ข้อมูลเมตาขั้นสูงเพื่อให้อ่าน เพิ่ม อัปเดต ลบ ค้นหา เปรียบเทียบ แลกเปลี่ยน และส่งออกข้อมูลเมตาดาต้าจากรูปภาพและรูปแบบเอกสารได้อย่างง่ายดายโดยไม่ต้องใช้ซอฟต์แวร์ภายนอกใดๆ . ลบรายละเอียดเมตาดาต้าออกจากเอกสาร Word, สเปรดชีต Excel, งานนำเสนอ PowerPoint, อีเมล Outlook, OneNote, Visio, โครงการ, PDF, AutoCAD, ZIp, รูปแบบไฟล์เสียงและวิดีโอ พร้อมด้วยการสนับสนุนสำหรับการทำงานกับคุณสมบัติการประมวลผลเมตาดาต้าอื่น ๆ อีกมากมาย"
  },
  "formats": {
    "title": "การลบข้อมูลเมตาของไฟล์รูปแบบอื่น",
    "description": "API การลบเอกสารหลายรูปแบบและข้อมูลเมตาของรูปภาพสำหรับ {{EnvName}} ดึงข้อมูลเมตาของรูปแบบไฟล์ยอดนิยมบางรูปแบบตามที่ระบุไว้ด้านล่าง"
  },
  "examples": {
    "comment_1": "ล้างข้อมูลเมตาของเอกสาร {{FileFormatUp}}",
    "comment_2": "ลบการกล่าวถึงบุคคลที่มีส่วนร่วมในการสร้างไฟล์ทั้งหมด",
    "comment_3": "ลบคุณสมบัติแบบกำหนดเองที่มีชื่อที่ระบุ",
    "comment_4": "บันทึกไฟล์ที่เคลียร์"
  },
  "steps": {
    "title": "ขั้นตอนในการลบข้อมูลเมตาไปยัง {{FileFormatUp}} ใน {{EnvName}}",
    "content": {
      "title": "[{{ProdShortName}}]({{ProductUrl}}) ช่วยให้นักพัฒนา {{EnvName}} ลบข้อมูลเมตาดาต้าจากไฟล์ {{FileFormatUp}} จากภายในแอปพลิเคชันของตนได้อย่างง่ายดายโดยทำตามขั้นตอนง่ายๆ เพียงไม่กี่ขั้นตอน",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} ที่จะอัปเดต",
      "step_2": "ส่งผ่านเพรดิเคตการค้นหาไปยังเมธอด {{TextRemoveProperties}}",
      "step_3": "ตรวจสอบจำนวนคุณสมบัติที่ถูกลบออกจริง",
      "step_4": "บันทึกการเปลี่ยนแปลง"
    }
  },
  "more_features": {
    "title": "จัดการข้อมูลเมตาของเอกสารได้อย่างง่ายดาย",
    "description": "โซลูชันของเราทำให้การจัดการข้อมูลเมตาของเอกสารของคุณง่ายขึ้น เข้าถึง แก้ไข และอัปเดตคุณสมบัติเอกสารต่างๆ ได้อย่างง่ายดายเพื่อให้ไฟล์ของคุณจัดระเบียบและค้นหาได้",
    "image_description": "ปกป้องข้อมูลเมตาของเอกสาร",
    "feature_1": {
      "title": "การควบคุมข้อมูลเมตาที่ง่ายดาย",
      "content": "รับและประมวลผลข้อมูลเมตาของเอกสารอย่างรวดเร็ว รับข้อมูลเชิงลึกอันมีค่า เช่น ผู้แต่ง วันที่สร้าง และอื่นๆ"
    },
    "feature_2": {
      "title": "การอัปเดตข้อมูลเมตาอย่างง่าย",
      "content": "แก้ไขข้อมูลเมตาของเอกสารโดยตรง อัปเดตคุณสมบัติเพื่อการจัดระเบียบที่ดีขึ้น ความสามารถในการค้นหา และข้อมูลที่ถูกต้อง"
    },
    "feature_3": {
      "title": "การจัดการข้อมูลเมตาที่มีประสิทธิภาพ",
      "content": "ดำเนินการขั้นสูงกับข้อมูลเมตาของเอกสาร จัดการงานต่างๆ ได้อย่างง่ายดาย เช่น การเพิ่มคุณสมบัติที่กำหนดเอง ลบข้อมูลที่ไม่จำเป็น และรับรองความสอดคล้องของข้อมูล"
    },
    "code_1": {
      "title": "ล้างข้อมูลเมตาของไฟล์ ZIP",
      "content": "ข้อมูลโค้ดต่อไปนี้แสดงวิธีลบความคิดเห็นของผู้ใช้ออกจากไฟล์ ZIP",
      "comment_1": "โหลดไฟล์เก็บถาวรเพื่อการประมวลผลต่อไป",
      "comment_2": "รับแพ็คเกจข้อมูลเมตาหลัก",
      "comment_3": "ลบความคิดเห็นที่เก็บถาวร",
      "comment_4": "บันทึกไฟล์ที่ล้างแล้ว"
    }
  }
}