{
  "head": {
    "title": "ลบข้อมูลเมตาจากไฟล์ {{FileFormatUp}} ในแอป {{ProgLang}}",
    "description": "ใช้ API {{ProgLang}} เพื่อเอาข้อมูลเมตาจากไฟล์ {{FileFormatUp}} รองรับฟอร์แมตต่างๆ เช่น XMP, EXIF, IPTC, ID3 และอื่นๆ"
  },
  "header": {
    "title": "ลบข้อมูลเมตาจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ลบข้อมูลเมตาจากเอกสาร รูปภาพ ไฟล์เสียง และวิดีโอด้วย API {{ProdFullName}}",
    "subtitle": "API {{ProdFullName}}",
    "action_title": "ดาวน์โหลดเวอร์ชั่นทดลองใช้ฟรี"
  },
  "about": {
    "title": "{{ProdFullName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มอบความสามารถอันทรงพลังในการจัดการข้อมูลเมตาให้กับนักพัฒนา—โดยไม่ต้องใช้ซอฟต์แวร์ภายนอก คุณสามารถอ่าน อัปเดต ลบ ค้นหา เปรียบเทียบ แทนที่ และส่งออกข้อมูลเมตาจากเอกสารและไฟล์สื่อ ลบข้อมูลเมตาจาก PDF, เอกสาร Word, แผ่น Excel, สไลด์ PowerPoint, ข้อความ Outlook, OneNote, Visio, Project, ภาพวาด AutoCAD, ไฟล์บีบอัด และรูปแบบมัลติมีเดีย"
  },
  "formats": {
    "title": "การลบข้อมูลเมตาจากประเภทไฟล์อื่นๆ",
    "description": "API การลบข้อมูลเมตาที่ยืดหยุ่นสำหรับ {{ProgLang}} ที่รองรับรูปแบบไฟล์ทั่วไปหลายประเภท ดูประเภทที่รองรับบางส่วนด้านล่าง"
  },
  "examples": {
    "comment_1": "ลบข้อมูลเมตาจากไฟล์ {{FileFormatUp}}",
    "comment_2": "ลบข้อมูลเมตาทั้งหมด",
    "comment_3": "แสดงจำนวนรายการที่ถูกลบ",
    "comment_4": "บันทึกเวอร์ชั่นที่สะอาด"
  },
  "steps": {
    "title": "วิธีการลบข้อมูลเมตาจาก {{FileFormatUp}} ใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{ProductUrl}}) ทำให้การลบข้อมูลเมตาจากไฟล์ {{FileFormatUp}} ง่ายสำหรับนักพัฒนาโดยการปฏิบัติตามไม่กี่ขั้นตอน",
      "step_1": "เปิดไฟล์ {{FileFormatUp}} โดยใช้คลาส {{TextMetadata}}",
      "step_2": "ลบข้อมูลเมตาทั้งหมดในไฟล์ที่โหลด",
      "step_3": "จัดการผลลัพธ์ของกระบวนการทำความสะอาด",
      "step_4": "บันทึกไฟล์ที่อัปเดตในรูปแบบ {{FileFormatUp}}"
    }
  },
  "more_features": {
    "title": "เครื่องมือทำความสะอาดข้อมูลเมตาที่ฉลาด",
    "description": "ใช้ API ของเราเพื่อทำให้ข้อมูลเมตาของไฟล์เรียบร้อย ทำเอกสารของคุณจัดการได้ง่ายขึ้น ค้นหาและป้องกัน",
    "image_description": "ทำความสะอาดข้อมูลเมตาของเอกสารอย่างง่าย",
    "feature_1": {
      "title": "ตัวอย่างข้อมูลเมตาที่รวดเร็ว",
      "content": "เห็นรายละเอียดข้อมูลเมตาที่สำคัญ เช่น ผู้เขียน เวลาสร้าง และคุณสมบัติอื่นๆ ทันที"
    },
    "feature_2": {
      "title": "การแก้ไขข้อมูลเมตาที่เรียบง่าย",
      "content": "แก้ไขข้อมูลเมตาโดยตรงเพื่อให้เอกสารของคุณเป็นระเบียบและค้นหาได้"
    },
    "feature_3": {
      "title": "การควบคุมข้อมูลเมตาอย่างเต็มที่",
      "content": "เพิ่มฟิลด์กำหนดเอง ลบข้อมูลที่ละเอียดอ่อน และทำให้แน่ใจว่าข้อมูลเมตานั้นสะอาดและสม่ำเสมอ"
    },
    "code_1": {
      "title": "ลบข้อมูลส่วนตัวจากไฟล์ DOCX",
      "content": "ตัวอย่างนี้แสดงวิธีการลบข้อมูลเมตาส่วนตัวจากเอกสาร Word",
      "comment_1": "โหลดเอกสารที่คุณต้องการแก้ไข",
      "comment_2": "เลือกประเภทข้อมูลเมตาที่จะลบ",
      "comment_3": "เคลียร์ข้อมูลเมตาที่เลือก",
      "comment_4": "บันทึกเอกสารหลังจากทำความสะอาด"
    }
  }
}