{
  "head": {
    "title": "{{ProgLang}}: เพิ่มข้อมูลเมตตาที่ไฟล์ {{FileFormatUp}}",
    "description": "ใช้ API {{ProgLang}} เพื่อแทรกข้อมูลเมตตาในไฟล์ {{FileFormatUp}} ทำงานกับมาตรฐานเช่น XMP, EXIF, IPTC, ID3 และอื่นๆ."
  },
  "header": {
    "title": "เพิ่มข้อมูลเมตตาที่ไฟล์ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ใช้ API {{ProdFullName}} เพื่อแทรกข้อมูลเมตตาที่กำหนดเองลงในเอกสาร รูปภาพ เสียง และรูปแบบวิดีโอหลากหลายประเภท.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดรุ่นทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มีเครื่องมือที่มีประสิทธิภาพสำหรับการจัดการข้อมูลเมตตา นักพัฒนาสามารถดู แก้ไข ลบ ค้นหา เปรียบเทียบ และส่งออกข้อมูลเมตตาจากเอกสารและรูปแบบสื่อที่หลากหลาย—โดยไม่ต้องใช้เครื่องมือภายนอก เพิ่มข้อมูลเมตตาในไฟล์ PDF, ไฟล์ Microsoft Office, Outlook, Visio, AutoCAD, อาร์คิฟ และไฟล์มัลติมีเดีย สร้างคุณสมบัติข้อมูลเมตตาที่ยืดหยุ่นในทุกแอปพลิเคชัน {{ProdShortName}}."
  },
  "formats": {
    "title": "รูปแบบที่รองรับสำหรับการเพิ่มข้อมูลเมตตา",
    "description": "เพิ่มข้อมูลเมตตาในเอกสารและรูปภาพในหลายรูปแบบโดยใช้ {{ProdShortName}} ด้านล่างนี้เป็นประเภทไฟล์ที่มักรองรับ."
  },
  "examples": {
    "comment_1": "โหลดไฟล์ด้วยคลาส {{TextMetadata}}",
    "comment_2": "เพิ่มคุณสมบัติข้อมูลเมตตาด้วยชื่อผู้เขียน",
    "comment_3": "ดำเนินการอัปเดตข้อมูลเมตตา",
    "comment_4": "บันทึกไฟล์ด้วยข้อมูลเมตตาใหม่"
  },
  "steps": {
    "title": "วิธีเพิ่มข้อมูลเมตตาที่ {{FileformatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "ด้วย [{{ProdShortName}}]({{PlatformLink}}) การเพิ่มข้อมูลเมตตาในไฟล์ {{FileFormatUp}} ในแอป {{ProgLang}} ทำได้โดยตรง ทำตามขั้นตอนเหล่านี้.",
      "step_1": "เปิดไฟล์ {{FileFormatUp}} ที่คุณต้องการอัปเดต.",
      "step_2": "กำหนดคีย์และค่าข้อมูลเมตตาที่จะเพิ่ม.",
      "step_3": "นำการเปลี่ยนแปลงไปใช้.",
      "step_4": "บันทึกไฟล์ที่อัปเดต."
    }
  },
  "more_features": {
    "title": "จัดการข้อมูลเมตตาของเอกสารได้อย่างมีประสิทธิภาพ",
    "description": "API ของเราทำให้การจัดการข้อมูลเมตตาง่ายขึ้น สามารถดู แก้ไข และจัดระเบียบคุณสมบัติของเอกสารเพื่อปรับปรุงการจัดการไฟล์และการค้นหา.",
    "image_description": "ฟีเจอร์สำหรับการแก้ไขข้อมูลเมตตา",
    "feature_1": {
      "title": "เข้าถึงข้อมูลเมตตา",
      "content": "อ่านและวิเคราะห์ข้อมูลเมตตาจากไฟล์ใดๆ ได้อย่างรวดเร็ว รับข้อมูลเช่นชื่อผู้เขียน วันเวลาที่สร้าง และอื่นๆ."
    },
    "feature_2": {
      "title": "แก้ไขข้อมูลเมตตา",
      "content": "ทำการเปลี่ยนแปลงข้อมูลเมตตาโดยตรง—อัปเดตแท็กเพื่อให้ไฟล์ได้รับการจัดระเบียบและค้นหาได้ง่าย."
    },
    "feature_3": {
      "title": "ฟีเจอร์ข้อมูลเมตตาขั้นสูง",
      "content": "ทำมากกว่าการจัดการข้อมูลเมตตา—เพิ่มฟิลด์ที่กำหนดเอง ลบข้อมูลที่ไม่ต้องการ และรักษาความสอดคล้องกัน."
    },
    "code_1": {
      "title": "เพิ่มข้อมูลเมตตาที่กำหนดเองให้กับไฟล์ TIFF",
      "content": "โค้ดตัวอย่างนี้แสดงวิธีการแทรกแท็กข้อมูลเมตตาที่กำหนดเองลงในภาพ TIFF.",
      "comment_1": "เปิดภาพ TIFF",
      "comment_2": "กำหนดคีย์และค่าของข้อมูลเมตตา",
      "comment_3": "เพิ่มข้อมูลเมตตา",
      "comment_4": "บันทึกภาพที่อัปเดต"
    }
  }
}