{
  "head": {
    "title": "Додайте метадані до файлів {{FileFormatUp}} у програмах {{ProgLang}}",
    "description": "API обробки метаданих {{ProgLang}} для додавання інформації метаданих до файлів {{FileFormatUp}}. Робота зі стандартами метаданих XMP, EXIF, IPTC, ID3 тощо."
  },
  "header": {
    "title": "Додавання метаданих до {{FileFormatUp}} у {{ProgLang}}",
    "description": "Додайте спеціальні властивості метаданих до широкого діапазону ділових документів, зображень, форматів аудіо- та відеофайлів за допомогою {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажте безкоштовну пробну версію"
  },
  "about": {
    "title": "Про API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — це розширене рішення для керування полями метаданих і керування ними для легкого перегляду, оновлення, видалення, пошуку, порівняння, обміну та експорту інформації метаданих із форматів зображень і документів без використання зовнішнього програмного забезпечення . Додайте деталі метаданих до документів Word, електронних таблиць Excel, презентацій PowerPoint, електронних листів Outlook, OneNote, Visio, Project, PDF, AutoCAD, ZIp, форматів аудіо- та відеофайлів разом із підтримкою роботи з багатьма іншими функціями обробки метаданих."
  },
  "formats": {
    "title": "Додавання властивостей метаданих до інших форматів файлів",
    "description": "API додавання метаданих багатоформатних документів і зображень для {{EnvName}}. Отримайте метадані деяких популярних форматів файлів, як зазначено нижче."
  },
  "examples": {
    "comment_1": "завантажити файл в екземплярі класу {{TextMetadata}}",
    "comment_2": "додати властивість, що містить автора вмісту",
    "comment_3": "результати роботи процесу",
    "comment_4": "збережіть файл з оновленими метаданими"
  },
  "steps": {
    "title": "Кроки для додавання метаданих до {{FileFormatUp}} у {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) дозволяє розробникам {{EnvName}} легко додавати деталі метаданих до файлів {{FileFormatUp}} зі своїх програм, виконавши кілька простих кроків.",
      "step_1": "Завантажте {{FileFormatUp}} з екземпляром класу {{TextMetadata}}.",
      "step_2": "Використовуйте метод {{TextMetadataAddProperties}}, щоб додати властивості.",
      "step_3": "Використовуйте предикат, щоб знайти потрібні властивості метаданих.",
      "step_4": "Збережіть зміни у форматі {{FileFormatUp}}."
    }
  },
  "more_features": {
    "title": "Керування метаданими документів",
    "description": "Наш комплексний API оптимізує керування метаданими документів. Отримуйте доступ, редагуйте та керуйте різними властивостями документа для покращеної організації та пошуку.",
    "image_description": "Функціональність метаданих",
    "feature_1": {
      "title": "Доступ до метаданих",
      "content": "Легко отримуйте та обробляйте метадані документа. Отримуйте інформацію про такі властивості, як автор, дата створення та багато інших."
    },
    "feature_2": {
      "title": "Редагування метаданих",
      "content": "Змінюйте метадані документа безпосередньо. Оновіть властивості для кращої організації, можливості пошуку та точності інформації."
    },
    "feature_3": {
      "title": "Розширене керування метаданими",
      "content": "Виконуйте складні операції над метаданими документа. Ефективно вирішуйте такі завдання, як додавання спеціальних властивостей, видалення нерелевантних даних і забезпечення узгодженості даних."
    },
    "code_1": {
      "title": "Як додати спеціальні метадані до зображення TIFF",
      "content": "У цьому прикладі коду показано, як додати спеціальний тег до пакета EXIF",
      "comment_1": "Встановіть пакет EXIF, якщо він відсутній",
      "comment_2": "Додайте відому властивість",
      "comment_3": "Додати повністю настроювану властивість (яка не описана в специфікації EXIF)",
      "comment_4": "Зверніть увагу, що вибраний ідентифікатор може перетинатися з ідентифікаторами, які використовуються деякими сторонніми інструментами"
    }
  }
}