{
  "head": {
    "title": "Agregar metadatos a archivos {{FileFormatUp}} en aplicaciones {{ProgLang}}",
    "description": "{{ProgLang}} API de procesamiento de metadatos para agregar información de metadatos a archivos {{FileFormatUp}}. Trabaje con estándares de metadatos XMP, EXIF, IPTC, ID3, etc."
  },
  "header": {
    "title": "Agregar metadatos a {{FileFormatUp}} en {{ProgLang}}",
    "description": "Agregue propiedades de metadatos personalizados a una amplia gama de formatos de archivos de audio y video, imágenes y documentos comerciales usando {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Descargue prueba gratis"
  },
  "about": {
    "title": "Acerca de la API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) es una solución avanzada de gestión y manipulación de campos de metadatos para ver, actualizar, eliminar, buscar, comparar, intercambiar y exportar fácilmente información de metadatos de imágenes y formatos de documentos sin utilizar ningún software externo. . Agregue detalles de metadatos a documentos de Word, hojas de cálculo de Excel, presentaciones de PowerPoint, correos electrónicos de Outlook, OneNote, Visio, Project, PDF, AutoCAD, ZIP, formatos de archivos de audio y video junto con la compatibilidad para trabajar con muchas otras funciones de procesamiento de metadatos."
  },
  "formats": {
    "title": "Agregar propiedades de metadatos a otros formatos de archivo",
    "description": "API de adición de metadatos de imágenes y documentos multiformato para {{EnvName}}. Recupere metadatos de algunos de los formatos de archivo populares como se indica a continuación."
  },
  "examples": {
    "comment_1": "cargar el archivo en una instancia de la clase {{TextMetadata}}",
    "comment_2": "agregar una propiedad que contenga el autor del contenido",
    "comment_3": "resultados de la operación del proceso",
    "comment_4": "guarde el archivo con metadatos actualizados"
  },
  "steps": {
    "title": "Pasos para agregar metadatos a {{FileFormatUp}} en {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) facilita a los desarrolladores de {{EnvName}} agregar detalles de metadatos a archivos {{FileFormatUp}} desde sus aplicaciones mediante la implementación de unos sencillos pasos.",
      "step_1": "Cargue {{FileFormatUp}} con una instancia de la clase {{TextMetadata}}.",
      "step_2": "Utilice el método {{TextMetadataAddProperties}} para agregar las propiedades.",
      "step_3": "Utilice un predicado para encontrar las propiedades de metadatos deseadas.",
      "step_4": "Guarde los cambios nuevamente en formato {{FileFormatUp}}."
    }
  },
  "more_features": {
    "title": "Gestión de metadatos de documentos",
    "description": "Nuestra API integral agiliza la gestión de metadatos de documentos. Acceda, edite y manipule varias propiedades de documentos para mejorar la organización y la capacidad de búsqueda.",
    "image_description": "Funcionalidad de metadatos",
    "feature_1": {
      "title": "Acceso a metadatos",
      "content": "Recupere y procese sin esfuerzo los metadatos de un documento. Obtenga información sobre propiedades como autor, fecha de creación y muchas otras."
    },
    "feature_2": {
      "title": "Edición de metadatos",
      "content": "Modifique los metadatos del documento directamente. Actualice las propiedades para una mejor organización, capacidad de búsqueda y precisión de la información."
    },
    "feature_3": {
      "title": "Gestión avanzada de metadatos",
      "content": "Realice operaciones complejas sobre metadatos de documentos. Maneje de manera eficiente tareas como agregar propiedades personalizadas, eliminar datos irrelevantes y garantizar la coherencia de los datos."
    },
    "code_1": {
      "title": "Cómo borrar una imagen de metadatos no deseados",
      "content": "Este ejemplo de código muestra cómo eliminar metadatos EXIF ​​de un archivo",
      "comment_1": "pasar imagen al constructor de clase {{TextMetadata}}",
      "comment_2": "acceder al paquete raíz EXIF",
      "comment_3": "eliminar metadatos",
      "comment_4": "guardar archivo borrado"
    }
  }
}