{
  "head": {
    "title": "เพิ่มข้อมูลเมตาลงในไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}}",
    "description": "API การประมวลผลข้อมูลเมตา {{ProgLang}} เพื่อเพิ่มข้อมูลเมตาดาต้าลงในไฟล์ {{FileFormatUp}} ทำงานร่วมกับมาตรฐานข้อมูลเมตา XMP, EXIF, IPTC, ID3 ฯลฯ"
  },
  "header": {
    "title": "การเพิ่มข้อมูลเมตาไปยัง {{FileFormatUp}} ใน {{ProgLang}}",
    "description": "เพิ่มคุณสมบัติเมทาดาทาที่กำหนดเองให้กับเอกสารทางธุรกิจ รูปภาพ รูปแบบไฟล์เสียงและวิดีโอที่หลากหลายโดยใช้ {{ProdFullName}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API ของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันการจัดการและจัดการฟิลด์ข้อมูลเมตาขั้นสูงเพื่อดู อัปเดต ลบ ค้นหา เปรียบเทียบ แลกเปลี่ยน และส่งออกข้อมูลเมตาดาต้าจากรูปภาพและรูปแบบเอกสารได้อย่างง่ายดายโดยไม่ต้องใช้ซอฟต์แวร์ภายนอกใดๆ . เพิ่มรายละเอียดเมทาดาทาลงในเอกสาร Word, สเปรดชีต Excel, งานนำเสนอ PowerPoint, อีเมล Outlook, OneNote, Visio, Project, PDF, AutoCAD, ZIp, รูปแบบไฟล์เสียงและวิดีโอ พร้อมทั้งรองรับการทำงานกับฟีเจอร์การประมวลผลเมทาดาทาอื่นๆ อีกมากมาย"
  },
  "formats": {
    "title": "การเพิ่มคุณสมบัติเมทาดาทาให้กับรูปแบบไฟล์อื่นๆ",
    "description": "API การเพิ่มข้อมูลเมตาของเอกสารและรูปภาพหลายรูปแบบสำหรับ {{EnvName}} ดึงข้อมูลเมตาของรูปแบบไฟล์ยอดนิยมบางรูปแบบตามที่ระบุไว้ด้านล่าง"
  },
  "examples": {
    "comment_1": "โหลดไฟล์ในอินสแตนซ์ของคลาส {{TextMetadata}}",
    "comment_2": "เพิ่มคุณสมบัติที่มีผู้เขียนเนื้อหา",
    "comment_3": "ผลการดำเนินงานของกระบวนการ",
    "comment_4": "บันทึกไฟล์ด้วยข้อมูลเมตาที่อัปเดต"
  },
  "steps": {
    "title": "ขั้นตอนในการเพิ่มข้อมูลเมตาลงใน {{FileFormatUp}} ใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ทำให้นักพัฒนา {{EnvName}} เพิ่มรายละเอียดข้อมูลเมตาลงในไฟล์ {{FileFormatUp}} จากภายในแอปพลิเคชันได้อย่างง่ายดายโดยทำตามขั้นตอนง่ายๆ เพียงไม่กี่ขั้นตอน",
      "step_1": "โหลด {{FileFormatUp}} ด้วยอินสแตนซ์ของคลาส {{TextMetadata}}",
      "step_2": "ใช้วิธี {{TextMetadataAddProperties}} เพื่อเพิ่มคุณสมบัติ",
      "step_3": "ใช้เพรดิเคตเพื่อค้นหาคุณสมบัติเมทาดาทาที่ต้องการ",
      "step_4": "บันทึกการเปลี่ยนแปลงกลับในรูปแบบ {{FileFormatUp}}"
    }
  },
  "more_features": {
    "title": "การจัดการข้อมูลเมตาของเอกสาร",
    "description": "API ที่ครอบคลุมของเราเพิ่มความคล่องตัวในการจัดการข้อมูลเมตาของเอกสาร เข้าถึง แก้ไข และจัดการคุณสมบัติของเอกสารต่างๆ เพื่อปรับปรุงการจัดระเบียบและความสามารถในการค้นหา",
    "image_description": "ฟังก์ชันการทำงานของข้อมูลเมตา",
    "feature_1": {
      "title": "การเข้าถึงข้อมูลเมตา",
      "content": "ดึงและประมวลผลข้อมูลเมตาของเอกสารได้อย่างง่ายดาย รับข้อมูลเชิงลึกเกี่ยวกับคุณสมบัติ เช่น ผู้เขียน วันที่สร้าง และอื่นๆ อีกมากมาย"
    },
    "feature_2": {
      "title": "การแก้ไขข้อมูลเมตา",
      "content": "แก้ไขข้อมูลเมตาของเอกสารโดยตรง อัปเดตคุณสมบัติเพื่อการจัดระเบียบที่ดีขึ้น ความสามารถในการค้นหา และความถูกต้องของข้อมูล"
    },
    "feature_3": {
      "title": "การจัดการข้อมูลเมตาขั้นสูง",
      "content": "ดำเนินการที่ซับซ้อนกับข้อมูลเมตาของเอกสาร จัดการงานอย่างมีประสิทธิภาพ เช่น การเพิ่มคุณสมบัติที่กำหนดเอง การลบข้อมูลที่ไม่เกี่ยวข้อง และรับรองความสอดคล้องของข้อมูล"
    },
    "code_1": {
      "title": "วิธีเพิ่มข้อมูลเมตาที่กำหนดเองให้กับภาพ TIFF",
      "content": "ตัวอย่างโค้ดนี้สาธิตวิธีเพิ่มแท็กที่กำหนดเองลงในแพ็คเกจ EXIF",
      "comment_1": "ตั้งค่าแพ็คเกจ EXIF ​​ถ้ามันหายไป",
      "comment_2": "เพิ่มคุณสมบัติที่รู้จัก",
      "comment_3": "เพิ่มคุณสมบัติที่กำหนดเองโดยสมบูรณ์ (ซึ่งไม่ได้อธิบายไว้ในข้อกำหนด EXIF)",
      "comment_4": "โปรดทราบว่ารหัสที่เลือกอาจตัดกันกับรหัสที่ใช้โดยเครื่องมือของบุคคลที่สาม"
    }
  }
}