{
  "head": {
    "title": "เพิ่มข้อมูลเมตาลงในไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}}",
    "description": "API การประมวลผลข้อมูลเมตา {{ProgLang}} เพื่อเพิ่มข้อมูลเมตาดาต้าลงในไฟล์ {{FileFormatUp}} ทำงานร่วมกับมาตรฐานข้อมูลเมตา XMP, EXIF, IPTC, ID3 ฯลฯ"
  },
  "header": {
    "title": "การเพิ่มข้อมูลเมตาไปยัง {{FileFormatUp}} ใน {{ProgLang}}",
    "description": "เพิ่มคุณสมบัติเมทาดาทาที่กำหนดเองให้กับเอกสารทางธุรกิจ รูปภาพ รูปแบบไฟล์เสียงและวิดีโอที่หลากหลายโดยใช้ {{ProdFullName}} API",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API ของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) นำเสนอชุดคุณลักษณะการจัดการและจัดการข้อมูลเมตาขั้นสูง ช่วยให้โปรแกรมเมอร์ {{EnvName}} สามารถดู แก้ไข ลบ ค้นหา เปรียบเทียบ สลับ และส่งออกข้อมูลเมตาดาต้าจาก รูปภาพและรูปแบบเอกสารโดยไม่ต้องใช้ซอฟต์แวร์ภายนอก เพิ่มรายละเอียดเมตาดาต้าลงในรูปแบบไฟล์ PDF, Microsoft Word, Excel, PowerPoint, Outlook, OneNote, Visio, Project, AutoCAD, Archive และมัลติมีเดีย พร้อมการสนับสนุนเพิ่มเติมเพื่อดำเนินการข้อมูลเมตาบนแอปพลิเคชันที่ใช้ {{ProdShortName}} ใดๆ ที่มีความยืดหยุ่นอย่างแท้จริง"
  },
  "formats": {
    "title": "การเพิ่มคุณสมบัติเมทาดาทาให้กับรูปแบบไฟล์อื่นๆ",
    "description": "API การเพิ่มข้อมูลเมตาของเอกสารและรูปภาพหลายรูปแบบสำหรับ {{ProdShortName}} ดึงข้อมูลเมตาของรูปแบบไฟล์ยอดนิยมบางรูปแบบตามที่ระบุไว้ด้านล่าง"
  },
  "examples": {
    "comment_1": "โหลดไฟล์ในอินสแตนซ์ของคลาส {{TextMetadata}}",
    "comment_2": "เพิ่มคุณสมบัติที่มีผู้เขียนเนื้อหา",
    "comment_3": "ผลการดำเนินงานของกระบวนการ",
    "comment_4": "บันทึกไฟล์ด้วยข้อมูลเมตาที่อัปเดต"
  },
  "steps": {
    "title": "ขั้นตอนในการเพิ่มข้อมูลเมตาลงใน {{FileformatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdFullName}}]({{PlatformLink}}) ทำให้นักพัฒนา {{EnvName}} เพิ่มรายละเอียดข้อมูลเมตาลงในไฟล์ {{FileFormatUp}} จากภายในแอปพลิเคชันได้อย่างง่ายดายโดยทำตามขั้นตอนง่ายๆ เพียงไม่กี่ขั้นตอน",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} ที่จะอัปเดต",
      "step_2": "ระบุภาคแสดงที่จะใช้ในการเพิ่มคุณสมบัติข้อมูลเมตา",
      "step_3": "ส่งภาคแสดงไปยังเมธอด {{TextMetadataAddProperties}}",
      "step_4": "บันทึกการเปลี่ยนแปลง"
    }
  },
  "more_features": {
    "title": "การจัดการข้อมูลเมตาของเอกสาร",
    "description": "API ที่แข็งแกร่งของเราทำให้การจัดการข้อมูลเมตาของเอกสารง่ายขึ้น เข้าถึง แก้ไข และจัดการคุณสมบัติของเอกสารที่หลากหลายได้อย่างราบรื่น เพื่อปรับปรุงการจัดระเบียบและความสามารถในการค้นหา",
    "image_description": "คุณสมบัติการจัดการข้อมูลเมตา",
    "feature_1": {
      "title": "การควบคุมข้อมูลเมตา",
      "content": "ดึงและประมวลผลข้อมูลเมตาจากเอกสารได้อย่างง่ายดาย รับข้อมูลเชิงลึกอันมีค่าเกี่ยวกับคุณสมบัติ เช่น ผู้แต่ง วันที่สร้าง และอื่นๆ"
    },
    "feature_2": {
      "title": "การแก้ไขข้อมูลเมตา",
      "content": "แก้ไขข้อมูลเมตาของเอกสารโดยตรง อัปเดตคุณสมบัติเพื่อปรับปรุงองค์กร เพิ่มความสามารถในการค้นหา และรับประกันข้อมูลที่ถูกต้อง"
    },
    "feature_3": {
      "title": "การจัดการข้อมูลเมตาขั้นสูง",
      "content": "ดำเนินการที่ซับซ้อนกับข้อมูลเมตาของเอกสาร เพิ่มคุณสมบัติที่กำหนดเองอย่างมีประสิทธิภาพ ลบข้อมูลที่ไม่จำเป็น และรักษาความสอดคล้องของข้อมูล"
    },
    "code_1": {
      "title": "วิธีเพิ่มข้อมูลเมตาที่กำหนดเองให้กับภาพ TIFF",
      "content": "ตัวอย่างนี้สาธิตวิธีการแทรกแท็กที่กำหนดเองลงในแพ็คเกจ EXIF",
      "comment_1": "กำหนดแพ็คเกจ EXIF ​​​​หากขาดหายไป",
      "comment_2": "แทรกคุณสมบัติที่ได้รับการยอมรับ",
      "comment_3": "รวมคุณสมบัติที่กำหนดเองโดยสมบูรณ์ซึ่งไม่ได้เป็นส่วนหนึ่งของข้อกำหนด EXIF",
      "comment_4": "โปรดทราบว่ารหัสที่เลือกอาจขัดแย้งกับรหัสที่ใช้โดยเครื่องมือของบุคคลที่สาม"
    }
  }
}